{
  "nb": {
    "coins": [
      {
        "title": "Under the falls",
        "desc": "Look underwater to the left of where the water fall lands. Follow the trail of gold coins to find a blue coin at the end. There is a bubba swimming around down here who should be avoided.<br><br>\n        You may want to avoid collecting all the gold coins on the swim down as you may need them for air on the swim back up. <br><br>\n\t\tAvailable <b>all episodes except 3</b>.",
        "video": "https://youtu.be/5TwmtCSJnB0"
      },
      {
        "title": "On the water (A)",
        "desc": "Two coins float just above the water. This one is to the left as you start. <br><br>\n        Both coins are much easier to get once the water has been cleaned up starting <b>episode 5</b>, until then use the boat to reach them.<br>\n        In <b>episode 1</b> the boat is right next to the first coin instead of at the boathouse where it normally is. <br><br>\n\t\tAvailable <b>all episodes except 3</b>.",
        "video": "https://youtu.be/WlT9Hou62tw"
      },
      {
        "title": "On the water (B)",
        "desc": "Two coins float just above the water. For this one, go to the left end of the cliff where it bows out in a semicircle. Then go straight out to sea from there to see the coin. <br><br>\n        Both coins are much easier to get once the water has been cleaned up starting <b>episode 5</b>, until then use the boat to reach them. <br>\n        In <b>episode 1</b> the boat is right next to the first coin instead of at the boathouse where it normally is. <br><br>\n\t\tAvailable <b>all episodes except 3</b>.",
        "video": "https://youtu.be/yEyqFkTO8TI"
      },
      {
        "title": "Upper right cubbyhole",
        "desc": "Go up the right cliff face and when you reach the second to last ledge, the one where the second pulley drops you off, check on the right for some narrow ledges sticking out of the cliff face.<br><br>\n        <i>Hover</i> to the first one, then <i>hover</i> to the one on its right, where there may be a springboard. Use the springboard to get the ledge above, the do a series of back-flip and <i>hover</i> combinations to reach a ledge with a rocket nozzle crate. Back-flip and <i>hover</i> to the cubbyhole above to find a coin. <br><br>\n        In <b>episodes 5 and 7</b>  the springboard is missing but it's still possible, though more difficult, to reach the ledges above it. Instead of stopping at the next to last ledge on the route to the top of the waterfall, go up another ledge, then do a triple jump right and <i>hover</i>.<br><br>\n\t\tAvailable <b>all episodes except 3</b>.",
        "video": "https://youtu.be/14fhGMNcYwc"
      },
      {
        "title": "Upper right coin stack",
        "desc": "From the ledge with the upper right cubbyhole coin, get the rocket nozzle and launch to collect gold coins and a blue coin at the top. You may have to hop just before the rocket goes off to get the extra few feet of altitude needed. <br><br>\n        Visible in all episodes except 3, but not reachable in <b>episode 5, 7 or 8</b> because the rocket nozzle isn't there.",
        "video": "https://youtu.be/oQNBuJyVzLI"
      },
      {
        "title": "Under the diving board",
        "desc": "Locate the diving board shaped ledge next to the top of the water fall. <br><br>\n        Go right and drop down to a ledge with a puddle of water, hop left from there and <i>hover</i> to a hole under the diving board, then collect the coin there. <br><br>\n        In <b>episode 6</b> there is a turbo nozzle crate here as well, but in other episodes there is a block of ice with a 1-up inside. <br><br>\n\t\tAvailable <b>all episodes except 3</b>.",
        "video": "https://youtu.be/-5OY49kabK4"
      },
      {
        "title": "Hidden wall kicks",
        "desc": "From the hole under the diving board, drop and <i>hover</i> to another hole directly below. There is a vertical passage hidden behind a wall above this, though there are some windows to mark its position. <br><br>\n        Do a series of wall jumps to get to the top and collect the coin that's visible through the windows. <br><br>\n        See the coin \"Lower pulley crevice\" for an alternate and perhaps easier route. <br><br>\n\t\tAvailable <b>all episodes except 3</b>.",
        "video": "https://youtu.be/yIqIKgBhwW4"
      },
      {
        "title": "Upper center cubbyhole",
        "desc": "Get to the top of the purple shell tower. This is easiest to do in <b>episode 6</b> since there are wires you can use to get from tower to tower.<br><br>\n        When you get to the shell entrance do a back-flip to the top. In earlier episodes you can use the rocket to this spot. From the shell, look straight toward the cliff face and notice a cubbyhole.<br><br>\n        Rocket or <i>hover</i> toward it to either land inside or grab the ledge, then pick up the coin. For an alternative strategy, see the \"Tricky ruins cubbyhole\" coin. <br><br>\n\t\tAvailable <b>all episodes except 3</b>.",
        "video": "https://youtu.be/ikRdmkxv2XA"
      },
      {
        "title": "Eely's domain columns (A)",
        "desc": "There are four blue coins in Eely-mouth's domain. When you enter the area, swim toward the outer walls and check the tops of the columns. <br><br>\n        It's much easier to do this in <b>episode 8</b>  because the columns have gold coins as well and you can refresh your air. Also the gold coins surrounding the blue coins make it easier to spot the location from a distance. <br><br>\n        In <b>episode 8</b>  there are two additional columns with gold coins only, so keep looking until you've found all six coin columns. Some of the coin columns go almost up to the ceiling so don't let yourself sink far when you're searching. <br><br>\n\t\tAvailable <b>episodes 4 and 8 only</b>.",
        "video": "https://youtu.be/RGzQCUK1YLE"
      },
      {
        "title": "Eely's domain columns (B)",
        "desc": "There are four blue coins in Eely-mouth's domain. When you enter the area, swim toward the outer walls and check the tops of the columns. <br><br>\n        It's much easier to do this in <b>episode 8</b>  because the columns have gold coins as well and you can refresh your air. Also the gold coins surrounding the blue coins make it easier to spot the location from a distance. <br><br>\n        In <b>episode 8</b>  there are two additional columns with gold coins only, so keep looking until you've found all six coin columns. Some of the coin columns go almost up to the ceiling so don't let yourself sink far when you're searching. <br><br>\n\t\tAvailable <b>episodes 4 and 8 only</b>.",
        "video": "https://youtu.be/RGzQCUK1YLE"
      },
      {
        "title": "Eely's domain columns (C)",
        "desc": "There are four blue coins in Eely-mouth's domain. When you enter the area, swim toward the outer walls and check the tops of the columns. <br><br>\n        It's much easier to do this in <b>episode 8</b>  because the columns have gold coins as well and you can refresh your air. Also the gold coins surrounding the blue coins make it easier to spot the location from a distance. <br><br>\n        In <b>episode 8</b>  there are two additional columns with gold coins only, so keep looking until you've found all six coin columns. Some of the coin columns go almost up to the ceiling so don't let yourself sink far when you're searching. <br><br>\n\t\tAvailable <b>episodes 4 and 8 only</b>.",
        "video": "https://youtu.be/RGzQCUK1YLE"
      },
      {
        "title": "Eely's domain columns (D)",
        "desc": "There are four blue coins in Eely-mouth's domain. When you enter the area, swim toward the outer walls and check the tops of the columns. <br><br>\n        It's much easier to do this in <b>episode 8</b>  because the columns have gold coins as well and you can refresh your air. Also the gold coins surrounding the blue coins make it easier to spot the location from a distance. <br><br>\n        In <b>episode 8</b>  there are two additional columns with gold coins only, so keep looking until you've found all six coin columns. Some of the coin columns go almost up to the ceiling so don't let yourself sink far when you're searching. <br><br>\n\t\tAvailable <b>episodes 4 and 8 only</b>.",
        "video": "https://youtu.be/RGzQCUK1YLE"
      },
      {
        "title": "Tricky ruins start",
        "desc": "Spray the stone square to open the first maze in the tricky ruins. Go to the upper left and drop down into the opening below. <br><br>\n        Hop up to the ledge and collect the coin there. <br><br>\n\t\tAvailable <b>all episodes except 1 and 3</b>.",
        "video": "https://youtu.be/O0iVsCsftK0"
      },
      {
        "title": "Tricky ruins cubbyhole",
        "desc": "Get to the second maze in the tricky ruins, From the top passage, hop out and <i>hover</i> up to the cubbyholes above. <i>hover</i> from hole to hole to reach the second one from the left and get a blue coin. <br><br>\n        Starting from the top passage is an alternate route to the 'Upper center cubbyhole' coin. Run and hop out of the cliff without hitting your head, then <i>hover</i> left and you should be able to reach the cubbyhole. This is tricky, but it may be faster.<br><br>\n\t\tAvailable <b>all episodes except 1 and 3</b>.",
        "video": "https://youtu.be/dKXlZe_yZ8I"
      },
      {
        "title": "Hidden ruins lower left",
        "desc": "Get the ledge between the first and second mazes of the tricky ruins. Now go to the left end of the ledge and drop to the ledge below, it has a doorway behind it. <br><br>\n        This route doesn't work in <b>episode 1</b> but you can still get to this ledge by bouncing on the floating wicker platform just off-shore. <br><br>\n        Enter the doorway and follow the hidden passage to a shallow opening further left. Spray the wall here to open a gap between two walls. There are three doorways in the left wall and two in the right wall. <br><br>\n        Wall jump to the lower doorway on the left, then follow the hidden passage to an opening in the cliff face where it bows out in a semicircle. Spray the squares there to reveal a blue coin in the cubbyhole behind the upper one.",
        "video": "https://youtu.be/HPLEvRf8hlk"
      },
      {
        "title": "Hidden ruins middle left",
        "desc": "Open the gap between walls in the hidden ruins and wall jump to the middle doorway on the left, then follow the passage to an opening on the cliff face to the right of where the lower left tunnel opens. <br><br>\n        Spray the wall on the left and get the blue coin from the upper cubbyhole.",
        "video": "https://youtu.be/pnEFVs30LDA"
      },
      {
        "title": "Hidden ruins upper left (A)",
        "desc": "Open the gap between walls in the hidden ruins and wall jump to the upper doorway on the left, then follow the hidden passage to an opening next to where the middle left tunnel opens. Drop from here to a very small ledge below. <br><br>\n        Spray the wall next to this ledge to open two cubbyholes with a blue coin in the upper one. Now hop to the ledge just to the right of this and spray the squares to get a blue coin in the cubbyhole on the right.",
        "video": "https://youtu.be/D-WregKWCTw"
      },
      {
        "title": "Hidden ruins upper left (B)",
        "desc": "Open the gap between walls in the hidden ruins and wall jump to the upper doorway on the left, then follow the hidden passage to an opening next to where the middle left tunnel opens. Drop from here to a very small ledge below. <br><br>\n        Spray the wall next to this ledge to open two cubbyholes with a blue coin in the upper one. Now hop to the ledge just to the right of this and spray the squares to get a blue coin in the cubbyhole on the right.",
        "video": "https://youtu.be/dC35dLY7Ysc"
      },
      {
        "title": "Hidden ruins lower right",
        "desc": "Open the gap between walls in the hidden ruins and wall jump to the lower doorway on the right. Follow the short hidden path to an opening to the left of ledge between the two mazes of the tricky ruins. <br><br>\n        Collect the coin at the exit. you can also <i>hover</i> to the coin from the ledge nearby. <br><br>\n\t\tAvailable <b>all episodes except 3</b>.",
        "video": "https://youtu.be/Dd_DTaMCZ-s"
      },
      {
        "title": "Hidden ruins upper right",
        "desc": "Open the gap between walls in the hidden ruins and wall jump to the upper doorway on the right.<br><br>\n        Follow the hidden path to an opening high above the ledge between the two mazes of the tricky ruins.<br><br>\n        Collect the coin at the exit. Note, this gives a way to reach the ledge between the mazes in <b>episode 1</b>.<br>\n        You can also reach the coin from the ledge below using the rocket or by hovering across from another ruin. <br><br>\n\t\tAvailable <b>all episodes except 3</b>.",
        "video": "https://youtu.be/kt0YFrvXjw0"
      },
      {
        "title": "Left ruins cubbyhole",
        "desc": "Go left from the start of the tricky ruins to a gap between two walls at the base of the cliff. This is directly below the hidden ruins. <br><br>\n        Wall jump to the top and enter the doorway on the left. Follow the hidden passage to a shallow opening in the cliff below where the lower left hidden ruins passage ends. (You can spray to open a cubbyhole here but it's empty.) <br><br>\n        Hop up to the hole and go in, you are bounced upward to the ledge above. take a moment to enjoy the view, then drop off the front of the ledge to land on a ledge above the openings from the hidden tunnels. <br><br>\n        spray the wall here to open two cubbyholes and get a coin from the one on the left. <br><br>\n\t\tAvailable <b>all episodes except 3</b>.",
        "video": "https://youtu.be/GoeBn6jGIok"
      },
      {
        "title": "Hidden ruins top cubbyhole (A)",
        "desc": "You need to get to the top of the hidden ruins.<br><br>\n        Follow the 'Left ruins cubbyhole' directions to the high ledge, the hop right and <i>hover</i> to the top opening where the coin is.<br><br>\n        Alternatively, open the gap between walls in the hidden ruins and wall jump all the way to the top. Come out to a ledge and do a series of back-flips to get to the top.<br>\n        Now spray the seven squares to open cubbyholes and get a coin each from the upper right and lower left (this one). What looks like a cubbyhole in the center here is actually a hole that ends on a ledge below. <br><br>\n\t\tAvailable <b>all episodes except 3</b>.",
        "video": "https://youtu.be/_e0uQkFxVIc"
      },
      {
        "title": "Hidden ruins top cubbyhole (B)",
        "desc": "You need to get to the top of the hidden ruins.<br><br>\n        Follow the 'Left ruins cubbyhole' directions to the high ledge, the hop right and <i>hover</i> to the top opening where the coin is.<br><br>\n        Alternatively, open the gap between walls in the hidden ruins and wall jump all the way to the top. Come out to a ledge and do a series of back-flips to get to the top.<br>\n        Now spray the seven squares to open cubbyholes and get a coin each from the upper right (this one) and lower left. What looks like a cubbyhole in the center here is actually a hole that ends on a ledge below. <br><br>\n\t\tAvailable <b>all episodes except 3</b>.",
        "video": "https://youtu.be/bhLmhAHX0SU"
      },
      {
        "title": "Lower pulley crevice",
        "desc": "Go up the right cliff face as you would in <b>episode 1</b>. When you reach the second basket, drop from the cliff and sidle along the crevice to the left.<br><br>\n        At the end of the crevice, spray the wall and part of it will retreat into the cliff leaving an opening you can hop into. Wall jump to collect the coin there. <br><br>\n        (There is an alternate route to the \"Hidden wall kicks\" coin here. Keep following the crevice left, down at an angle for a part, to land at the hole below the other coin.) <br><br>\n\t\tAvailable <b>all episodes except 3</b>.",
        "video": "https://youtu.be/rT89ZBeZCIA"
      },
      {
        "title": "Upper pulley crevice",
        "desc": "Go up the right cliff face as you would in <b>episode 1</b>. When you reach the top of the ramp that leads to the upper pulley wheel, drop off to a small ledge behind the wheel. <br><br>\n        Follow this ledge do an opening in the cliff, then sidle along the crevice to the left. At the end of the crevice, spray the wall and part of it will retreat into the cliff leaving an opening you can hop into. <br><br>\n        Hop up and drop to the lower part to get the coin. <br><br>\n\t\tAvailable <b>all episodes except 3</b>.",
        "video": "https://youtu.be/eGmkaXm4SLU"
      },
      {
        "title": "Tricky ruins M",
        "desc": "Go to the ledge between the first and second mazes in the tricky ruins. Locate the graffiti M on the right and wash it off for a blue coin.",
        "video": "https://youtu.be/RST2E3gQZVk"
      },
      {
        "title": "Paired circles (A)",
        "desc": "First, follow the directions for the \"Under the diving board\" coin and get the turbo nozzle. <br><br>\n        Locate the graffiti circle at the base of the right cliffs, then locate the corresponding circle behind and to the left of the boathouse. <br><br>\n        Wash one circle off to make a blue coin appear at the other circle, then quickly get to the other circle to collect the coin before it disappears. <br>\n        Turbo seems to be required to get the necessary speed. <br><br>\n\t\tAvailable <b>episode 6</b> only.",
        "video": "https://youtu.be/FEk6CNzSwtM"
      },
      {
        "title": "Paired circles (B)",
        "desc": "First, follow the directions for the 'Under the diving board' coin and get the turbo nozzle. <br><br>\n        Locate the graffiti circle behind and to the left of the boathouse, then locate the corresponding circle at the base of the right cliffs. <br><br>\n        Wash one circle off to make a blue coin appear at the other circle, then quickly get to the other circle to collect the coin before it disappears. <br>\n        Turbo seems to be required to get the necessary speed. <br><br>\n\t\tAvailable <b>episode 6</b> only.",
        "video": "https://youtu.be/oSMOmWPmw6g"
      },
      {
        "title": "Jars in the tomb (A)",
        "desc": "Enter the kings tomb (see the StrategyWiki's <b>episode 2</b> walk-through).<br><br>\n        Locate the two large jars stored in the walls and spray them with water to get a blue coin for each. Some of the smaller vases give you gold coins as well. <br><br>\n        You can exit through the window here to get back to the main area. <br><br>\n\t\tAvailable <b>all episodes except 1 and 3</b>.",
        "video": "https://youtu.be/MFherHv1oNE"
      },
      {
        "title": "Jars in the tomb (B)",
        "desc": "Enter the kings tomb (see the StrategyWiki's <b>episode 2</b> walk-through).<br><br>\n        Locate the two large jars stored in the walls and spray them with water to get a blue coin for each. Some of the smaller vases give you gold coins as well. <br><br>\n        You can exit through the window here to get back to the main area. <br><br>\n\t\tAvailable <b>all episodes except 1 and 3</b>.",
        "video": "https://youtu.be/8-UqUD2c6j0"
      }
    ],
    "title": "Noki Bay",
    "link": "https://strategywiki.org/wiki/Super_Mario_Sunshine/Noki_Bay_blue_coins"
  },
  "cm": {
    "coins": [
      {
        "title": "After the 1-Up",
        "desc": "After the 1-Up mushroom placed on the broken sidewalk, there should be another broken sidewalk platform with the blue coin in plain sight.",
        "video": "https://youtu.be/7lGlC1_4xys"
      },
      {
        "title": "After Using The Boat (A)",
        "desc": "Using the boat, get to the platform at the end of the volcano area. <br><br>\n        Get all the outer coins first. If you crash at this point, that's OK.<br><br>\n        Now, get all the coins in the inner area. <i>Hover</i> but don't jump to the blue coins and then <i>hover</i> back.",
        "video": "https://youtu.be/eow4YXMQF-Y"
      },
      {
        "title": "After Using The Boat (B)",
        "desc": "Using the boat, get to the platform at the end of the volcano area. <br><br>\n        Get all the outer coins first. If you crash at this point, that's OK.<br><br>\n        Now, get all the coins in the inner area. <i>Hover</i> but don't jump to the blue coins and then <i>hover</i> back.",
        "video": "https://youtu.be/4_36Js3s2Mk"
      },
      {
        "title": "After Using The Boat (C)",
        "desc": "Using the boat, get to the platform at the end of the volcano area. <br><br>\n        Get all the outer coins first. If you crash at this point, that's OK.<br><br>\n        Now, get all the coins in the inner area. <i>Hover</i> but don't jump to the blue coins and then <i>hover</i> back.",
        "video": "https://youtu.be/5YXUbtXQ6rM"
      },
      {
        "title": "After Using The Boat (D)",
        "desc": "Using the boat, get to the platform at the end of the volcano area. <br><br>\n        Get all the outer coins first. If you crash at this point, that's OK.<br><br>\n        Now, get all the coins in the inner area. <i>Hover</i> but don't jump to the blue coins and then <i>hover</i> back.",
        "video": "https://youtu.be/KDDjShomieE"
      },
      {
        "title": "After Using The Boat (E)",
        "desc": "Using the boat, get to the platform at the end of the volcano area. <br><br>\n        Get all the outer coins first. If you crash at this point, that's OK.<br><br>\n        Now, get all the coins in the inner area. <i>Hover</i> but don't jump to the blue coins and then <i>hover</i> back.",
        "video": "https://youtu.be/195NSMRm40I"
      },
      {
        "title": "After Using The Boat (F)",
        "desc": "Using the boat, get to the platform at the end of the volcano area. <br><br>\n        Get all the outer coins first. If you crash at this point, that's OK.<br><br>\n        Now, get all the coins in the inner area. <i>Hover</i> but don't jump to the blue coins and then <i>hover</i> back.",
        "video": "https://youtu.be/zXPwhhu90mo"
      },
      {
        "title": "After Using The Boat (G)",
        "desc": "Using the boat, get to the platform at the end of the volcano area. <br><br>\n        Get all the outer coins first. If you crash at this point, that's OK.<br><br>\n        Now, get all the coins in the inner area. <i>Hover</i> but don't jump to the blue coins and then <i>hover</i> back.",
        "video": "https://youtu.be/pUNi-HQW6oI"
      },
      {
        "title": "After Using The Boat (H)",
        "desc": "Using the boat, get to the platform at the end of the volcano area. <br><br>\n        Get all the outer coins first. If you crash at this point, that's OK.<br><br>\n        Now, get all the coins in the inner area. <i>Hover</i> but don't jump to the blue coins and then <i>hover</i> back.",
        "video": "https://youtu.be/ZDIZ6RDGXW0"
      },
      {
        "title": "After Using The Boat (I)",
        "desc": "Using the boat, get to the platform at the end of the volcano area. <br><br>\n        Get all the outer coins first. If you crash at this point, that's OK.<br><br>\n        Now, get all the coins in the inner area. <i>Hover</i> but don't jump to the blue coins and then <i>hover</i> back.",
        "video": "https://youtu.be/vne74kWBdio"
      }
    ],
    "title": "Corona Mountain",
    "link": "https://strategywiki.org/wiki/Super_Mario_Sunshine/Corona_Mountain_blue_coins"
  },
  "dp": {
    "coins": [
      {
        "title": "Jail Cell",
        "desc": "Find the building with the bell tower in the southeast corner of the plaza. It is located at the opposite end of the beach from the lighthouse. <br><br>\n        In the back on the south side, over the water, is an open window. Hop from the ledge nearby and <i>hover</i> into the window to land in a room with barred windows. <br><br>\n        Liberate the coin that's doing time in there.",
        "video": "https://youtu.be/us840hxaKM0"
      },
      {
        "title": "Banana lady",
        "desc": "Look for a Pianta lady standing near a wall just south of the central dock. <br><br>\n        When you talk to her she offers you work collecting fruit for her. Gather three bunches of bananas and place them in her basket, then talk to her again to be rewarded with a blue coin.<br><br>\n        Bananas can be found in one of the fruit stalls, on a rooftop in the southeast corner of the square, and on the top of a tree west of the Pianta statue. Can be repeated for a 1-up.",
        "video": "https://youtu.be/ENYhufhFNi8"
      },
      {
        "title": "Coconut lady",
        "desc": "head to the boathouse in Delfino Plaza (where the portal to Ricco Harbor is) and look out to sea and you'll notice a small island with a palm tree and a Pianta lady. <br><br>\n        Swim out there and talk to the lady. She'll ask you for 3 coconuts, and as luck would have it, there are 3 coconuts hanging in the tree right next to her. Spray them to knock them down and then put the in her basket one by one. <br><br>\n        Don't worry if some of them fall in the sea as they will grow back again straight away. Can be repeated for a 1-up.",
        "video": "https://youtu.be/ENYhufhFNi8"
      },
      {
        "title": "Pineapple lady",
        "desc": "This woman is standing next to the giant Shine Gate north of the central dock area and she asks for pineapples.<br><br>\n        Her basket is high off the ground so you'll need to throw (jump + B) the fruits in. Finding the best place to throw from takes a bit of trial and error but isn't as hard as it seems. <br><br>\n        Alternatively, you can bounce on her head three times and if you land on the edge of the basket, you can then simply drop the fruit in. Can be repeated for a 1-up.",
        "video": "https://youtu.be/e-8H1yL3dLk"
      },
      {
        "title": "Durian lady",
        "desc": "There are a few ways to get the durians to the basket but this seems to be the simplest. <br>\n        Get a durian from under the awning near the boathouse. You can also get durians from the fruit market but it's farther away. <br><br>\n        Gently kick it north along the boardwalk, then when you get close to the end aim toward the tree in the distance.<br><br>\n        If you run at the durian and press the B button just before you get to it, you will give it a mighty kick that will send it far into the distance. <br><br>\n        Then <i>hover</i> over and see where it landed (hopefully it didn't bounce into the water, if it did, just keep trying).<br>\n        From there, kick the durian through the archway and then go left to the little hill.",
        "video": "https://youtu.be/_7K8uQbCGqM"
      },
      {
        "title": "Shine gate M",
        "desc": "Locate the large crate in front of the Shine Gate (on the right side). <br><br>\n        Ground-pound this crate to smash it and reveal a graffiti \"M\", then spray the wall clean for the coin to pop out.",
        "video": "https://youtu.be/KH4FeDBFYq4"
      },
      {
        "title": "Rooftop M",
        "desc": "Locate the large crate on the rooftop over the inlet between the central dock and the ocean. <br><br>\n        Ground-pound this crate to smash it and reveal a graffiti \"M\", then spray the wall clean for the coin to pop out.",
        "video": "https://youtu.be/dVdy3pSUTAo"
      },
      {
        "title": "Tower M",
        "desc": "Go to the tower in the northwest corner of the plaza, near the red cannon that fires you over to Pinna Park. <br><br>\n        Look on the north side about half way up to find a graffiti \"M\", then clean it off for the coin to appear.",
        "video": "https://youtu.be/FC_uDPCqh4E"
      },
      {
        "title": "Paired crosses (A)",
        "desc": "Locate a graffiti cross on the east side of the base of the Pianta statue (right of the Bianco Hills entrance). Locate a corresponding cross one the west side of the southwest tower (the one with the radio dish). <br><br>\n        Wash one cross off to make a blue coin appear at the other cross, then quickly get to the other cross to collect the coin before it disappears. <br><br>\n        <br>The slip-slide move is very useful here for covering the distance in time, or wait until you get the <i>turbo nozzle</i> and use it.",
        "video": "https://youtu.be/SYY0w5KACo4"
      },
      {
        "title": "Paired crosses (B)",
        "desc": "Locate a graffiti cross on the east side of the base of the Pianta statue (the one with the radio dish). Locate a corresponding cross one the west side of the southwest tower (right of the Bianco Hills entrance). <br><br>\n        Wash one cross off to make a blue coin appear at the other cross, then quickly get to the other cross to collect the coin before it disappears. <br><br>\n        <br>The slip-slide move is very useful here for covering the distance in time, or wait until you get the <i>turbo nozzle</i> and use it.",
        "video": "https://youtu.be/TXLEWuw9tf0"
      },
      {
        "title": "Flaming Pianta",
        "desc": "This might sound like the name of a refreshing cocktail, but after you open Gelato beach there actually is a Pianta fellow running around wearing a backpack that's on fire! <br><br>\n        He normally is found on the beach near the lighthouse but may also appear next to the central dock.<br><br>\n        You need to chase him around with FLUDD going to put out the fire, then talk to him to be rewarded with a blue coin. After collecting the coin, the same Pianta can be seen wandering around with his backpack full of red mushrooms.",
        "video": "https://youtu.be/MMjz6h2XwTQ"
      },
      {
        "title": "Blue parrots (A)",
        "desc": "Spray the parrot on the roof of the building to the left of the shine gate. Wait for the parrot to fly near and squirt it in mid-air. A few good hits should turn it into a blue coin.",
        "video": "https://youtu.be/qaqbX634oUM"
      },
      {
        "title": "Blue parrots (B)",
        "desc": "Spray the parrot on the roof of the building north of the Pianta statue. Wait for the parrot to fly near and squirt it in mid-air. A few good hits should turn it into a blue coin.",
        "video": "https://youtu.be/uj_O5YbDhIY"
      },
      {
        "title": "North Tunnel",
        "desc": "There is a coin in the north end of a tunnel under the shine gate. (See video)",
        "video": "https://youtu.be/oaLBhwU8DNQ"
      },
      {
        "title": "Center Tunnel",
        "desc": "There is a coin in a tunnel under the dock by the shine gate. (See video)",
        "video": "https://youtu.be/7Im4nGfud_M"
      },
      {
        "title": "West Tunnel",
        "desc": "There is a coin in a underground passage that leads to the island with the coconut lady. (See video)",
        "video": "https://youtu.be/-MABfJXPocs"
      },
      {
        "title": "Northeast tower window",
        "desc": "Go to the rooftops in the northeast section of the plaza, between the shine gate and the lighthouse. Look on the north side to find some orange goop covering a window. Get Yoshi and spray the goop with fruit juice and it melts away. <br><br>\n        You can now hop into the window and collect the coin there. When you re-enter the plaza the goop will be restored even though there is no coin behind it.",
        "video": "https://youtu.be/wBuMdl-0D0w"
      },
      {
        "title": "Northwest tower window",
        "desc": "Go to the rooftops in the northwest section of the plaza, near the red cannon, and look on the east side of the tower to find some orange goop covering a window near the top.<br><br>\n        Get Yoshi and spray the goop with fruit juice so it melts away. Yoshi's fruit juice range is pretty good so you can to this from the next building over.<br><br>\n        Abandon Yoshi and climb the small ledge circling the tower. The sidestep move may come in handy here.<br><br>\n        Collect the coin when you reach the window.",
        "video": "https://youtu.be/WV9RFkU_-DM"
      },
      {
        "title": "Stone pillars in the sea",
        "desc": "Locate the pillars a little out to sea from the lighthouse. One of the further-out pillars has a double door in the bottom of it, which hides a blue coin.<br><br>\n        Equip the Turbo Nozzle and smash through the double doors to get the coin.",
        "video": "https://youtu.be/90yptuqLf5A"
      },
      {
        "title": "Waiting room ice",
        "desc": "Collect 10 gold coins in the plaza and talk to the Pianta by the boat at the southwest dock. Pay the fare to be taken back to the airport.<br><br>\n        You should see a turbo crate near the landing, so grab it and equip the <i>turbo nozzle</i>. Smash through the double doors of the building at the end of the landing to gain entrance to the airport waiting room. <br><br>\n        On the right find a block of ice. Switch to the squirt nozzle and spray the ice until it melts away leaving a blue coin. <br><br>\n        <u>Notes:<br></u>\n        - You can only get this coin after you have entered Corona Mountain at least once (whether you defeat Bowser or exit the stage).<br>\n        - Even though this is in the airport, it shows up in coin count for the plaza.",
        "video": "https://youtu.be/er3oiVOCoPA"
      }
    ],
    "title": "Delfino Plaza",
    "link": "https://strategywiki.org/wiki/Super_Mario_Sunshine/Delfino_Plaza_blue_coins"
  },
  "gb": {
    "coins": [
      {
        "title": "Under the falls",
        "desc": "Look underwater to the left of where the water fall lands. Follow the trail of gold coins to find a blue coin at the end. There is a bubba swimming around down here who should be avoided.<br><br>\n        You may want to avoid collecting all the gold coins on the swim down as you may need them for air on the swim back up. <br><br>\n\t\tAvailable <b>all episodes except 3</b>.",
        "video": "https://youtu.be/5TwmtCSJnB0"
      },
      {
        "title": "On the water (A)",
        "desc": "Two coins float just above the water. This one is to the left as you start. <br><br>\n        Both coins are much easier to get once the water has been cleaned up starting <b>episode 5</b>, until then use the boat to reach them.<br>\n        In <b>episode 1</b> the boat is right next to the first coin instead of at the boathouse where it normally is. <br><br>\n\t\tAvailable <b>all episodes except 3</b>.",
        "video": "https://youtu.be/WlT9Hou62tw"
      },
      {
        "title": "On the water (B)",
        "desc": "Two coins float just above the water. For this one, go to the left end of the cliff where it bows out in a semicircle. Then go straight out to sea from there to see the coin. <br><br>\n        Both coins are much easier to get once the water has been cleaned up starting <b>episode 5</b>, until then use the boat to reach them. <br>\n        In <b>episode 1</b> the boat is right next to the first coin instead of at the boathouse where it normally is. <br><br>\n\t\tAvailable <b>all episodes except 3</b>.",
        "video": "https://youtu.be/yEyqFkTO8TI"
      },
      {
        "title": "Upper right cubbyhole",
        "desc": "Go up the right cliff face and when you reach the second to last ledge, the one where the second pulley drops you off, check on the right for some narrow ledges sticking out of the cliff face.<br><br>\n        <i>Hover</i> to the first one, then <i>hover</i> to the one on its right, where there may be a springboard. Use the springboard to get the ledge above, the do a series of back-flip and <i>hover</i> combinations to reach a ledge with a rocket nozzle crate. Back-flip and <i>hover</i> to the cubbyhole above to find a coin. <br><br>\n        In <b>episodes 5 and 7</b>  the springboard is missing but it's still possible, though more difficult, to reach the ledges above it. Instead of stopping at the next to last ledge on the route to the top of the waterfall, go up another ledge, then do a triple jump right and <i>hover</i>.<br><br>\n\t\tAvailable <b>all episodes except 3</b>.",
        "video": "https://youtu.be/14fhGMNcYwc"
      },
      {
        "title": "Upper right coin stack",
        "desc": "From the ledge with the upper right cubbyhole coin, get the rocket nozzle and launch to collect gold coins and a blue coin at the top. You may have to hop just before the rocket goes off to get the extra few feet of altitude needed. <br><br>\n        Visible in all episodes except 3, but not reachable in <b>episode 5, 7 or 8</b> because the rocket nozzle isn't there.",
        "video": "https://youtu.be/oQNBuJyVzLI"
      },
      {
        "title": "Under the diving board",
        "desc": "Locate the diving board shaped ledge next to the top of the water fall. <br><br>\n        Go right and drop down to a ledge with a puddle of water, hop left from there and <i>hover</i> to a hole under the diving board, then collect the coin there. <br><br>\n        In <b>episode 6</b> there is a turbo nozzle crate here as well, but in other episodes there is a block of ice with a 1-up inside. <br><br>\n\t\tAvailable <b>all episodes except 3</b>.",
        "video": "https://youtu.be/-5OY49kabK4"
      },
      {
        "title": "Hidden wall kicks",
        "desc": "From the hole under the diving board, drop and <i>hover</i> to another hole directly below. There is a vertical passage hidden behind a wall above this, though there are some windows to mark its position. <br><br>\n        Do a series of wall jumps to get to the top and collect the coin that's visible through the windows. <br><br>\n        See the coin \"Lower pulley crevice\" for an alternate and perhaps easier route. <br><br>\n\t\tAvailable <b>all episodes except 3</b>.",
        "video": "https://youtu.be/yIqIKgBhwW4"
      },
      {
        "title": "Upper center cubbyhole",
        "desc": "Get to the top of the purple shell tower. This is easiest to do in <b>episode 6</b> since there are wires you can use to get from tower to tower.<br><br>\n        When you get to the shell entrance do a back-flip to the top. In earlier episodes you can use the rocket to this spot. From the shell, look straight toward the cliff face and notice a cubbyhole.<br><br>\n        Rocket or <i>hover</i> toward it to either land inside or grab the ledge, then pick up the coin. For an alternative strategy, see the \"Tricky ruins cubbyhole\" coin. <br><br>\n\t\tAvailable <b>all episodes except 3</b>.",
        "video": "https://youtu.be/ikRdmkxv2XA"
      },
      {
        "title": "Eely's domain columns (A)",
        "desc": "There are four blue coins in Eely-mouth's domain. When you enter the area, swim toward the outer walls and check the tops of the columns. <br><br>\n        It's much easier to do this in <b>episode 8</b>  because the columns have gold coins as well and you can refresh your air. Also the gold coins surrounding the blue coins make it easier to spot the location from a distance. <br><br>\n        In <b>episode 8</b>  there are two additional columns with gold coins only, so keep looking until you've found all six coin columns. Some of the coin columns go almost up to the ceiling so don't let yourself sink far when you're searching. <br><br>\n\t\tAvailable <b>episodes 4 and 8 only</b>.",
        "video": "https://youtu.be/RGzQCUK1YLE"
      },
      {
        "title": "Eely's domain columns (B)",
        "desc": "There are four blue coins in Eely-mouth's domain. When you enter the area, swim toward the outer walls and check the tops of the columns. <br><br>\n        It's much easier to do this in <b>episode 8</b>  because the columns have gold coins as well and you can refresh your air. Also the gold coins surrounding the blue coins make it easier to spot the location from a distance. <br><br>\n        In <b>episode 8</b>  there are two additional columns with gold coins only, so keep looking until you've found all six coin columns. Some of the coin columns go almost up to the ceiling so don't let yourself sink far when you're searching. <br><br>\n\t\tAvailable <b>episodes 4 and 8 only</b>.",
        "video": "https://youtu.be/RGzQCUK1YLE"
      },
      {
        "title": "Eely's domain columns (C)",
        "desc": "There are four blue coins in Eely-mouth's domain. When you enter the area, swim toward the outer walls and check the tops of the columns. <br><br>\n        It's much easier to do this in <b>episode 8</b>  because the columns have gold coins as well and you can refresh your air. Also the gold coins surrounding the blue coins make it easier to spot the location from a distance. <br><br>\n        In <b>episode 8</b>  there are two additional columns with gold coins only, so keep looking until you've found all six coin columns. Some of the coin columns go almost up to the ceiling so don't let yourself sink far when you're searching. <br><br>\n\t\tAvailable <b>episodes 4 and 8 only</b>.",
        "video": "https://youtu.be/RGzQCUK1YLE"
      },
      {
        "title": "Eely's domain columns (D)",
        "desc": "There are four blue coins in Eely-mouth's domain. When you enter the area, swim toward the outer walls and check the tops of the columns. <br><br>\n        It's much easier to do this in <b>episode 8</b>  because the columns have gold coins as well and you can refresh your air. Also the gold coins surrounding the blue coins make it easier to spot the location from a distance. <br><br>\n        In <b>episode 8</b>  there are two additional columns with gold coins only, so keep looking until you've found all six coin columns. Some of the coin columns go almost up to the ceiling so don't let yourself sink far when you're searching. <br><br>\n\t\tAvailable <b>episodes 4 and 8 only</b>.",
        "video": "https://youtu.be/RGzQCUK1YLE"
      },
      {
        "title": "Tricky ruins start",
        "desc": "Spray the stone square to open the first maze in the tricky ruins. Go to the upper left and drop down into the opening below. <br><br>\n        Hop up to the ledge and collect the coin there. <br><br>\n\t\tAvailable <b>all episodes except 1 and 3</b>.",
        "video": "https://youtu.be/O0iVsCsftK0"
      },
      {
        "title": "Tricky ruins cubbyhole",
        "desc": "Get to the second maze in the tricky ruins, From the top passage, hop out and <i>hover</i> up to the cubbyholes above. <i>hover</i> from hole to hole to reach the second one from the left and get a blue coin. <br><br>\n        Starting from the top passage is an alternate route to the 'Upper center cubbyhole' coin. Run and hop out of the cliff without hitting your head, then <i>hover</i> left and you should be able to reach the cubbyhole. This is tricky, but it may be faster.<br><br>\n\t\tAvailable <b>all episodes except 1 and 3</b>.",
        "video": "https://youtu.be/dKXlZe_yZ8I"
      },
      {
        "title": "Hidden ruins lower left",
        "desc": "Get the ledge between the first and second mazes of the tricky ruins. Now go to the left end of the ledge and drop to the ledge below, it has a doorway behind it. <br><br>\n        This route doesn't work in <b>episode 1</b> but you can still get to this ledge by bouncing on the floating wicker platform just off-shore. <br><br>\n        Enter the doorway and follow the hidden passage to a shallow opening further left. Spray the wall here to open a gap between two walls. There are three doorways in the left wall and two in the right wall. <br><br>\n        Wall jump to the lower doorway on the left, then follow the hidden passage to an opening in the cliff face where it bows out in a semicircle. Spray the squares there to reveal a blue coin in the cubbyhole behind the upper one.",
        "video": "https://youtu.be/HPLEvRf8hlk"
      },
      {
        "title": "Hidden ruins middle left",
        "desc": "Open the gap between walls in the hidden ruins and wall jump to the middle doorway on the left, then follow the passage to an opening on the cliff face to the right of where the lower left tunnel opens. <br><br>\n        Spray the wall on the left and get the blue coin from the upper cubbyhole.",
        "video": "https://youtu.be/pnEFVs30LDA"
      },
      {
        "title": "Hidden ruins upper left (A)",
        "desc": "Open the gap between walls in the hidden ruins and wall jump to the upper doorway on the left, then follow the hidden passage to an opening next to where the middle left tunnel opens. Drop from here to a very small ledge below. <br><br>\n        Spray the wall next to this ledge to open two cubbyholes with a blue coin in the upper one. Now hop to the ledge just to the right of this and spray the squares to get a blue coin in the cubbyhole on the right.",
        "video": "https://youtu.be/D-WregKWCTw"
      },
      {
        "title": "Hidden ruins upper left (B)",
        "desc": "Open the gap between walls in the hidden ruins and wall jump to the upper doorway on the left, then follow the hidden passage to an opening next to where the middle left tunnel opens. Drop from here to a very small ledge below. <br><br>\n        Spray the wall next to this ledge to open two cubbyholes with a blue coin in the upper one. Now hop to the ledge just to the right of this and spray the squares to get a blue coin in the cubbyhole on the right.",
        "video": "https://youtu.be/dC35dLY7Ysc"
      },
      {
        "title": "Hidden ruins lower right",
        "desc": "Open the gap between walls in the hidden ruins and wall jump to the lower doorway on the right. Follow the short hidden path to an opening to the left of ledge between the two mazes of the tricky ruins. <br><br>\n        Collect the coin at the exit. you can also <i>hover</i> to the coin from the ledge nearby. <br><br>\n\t\tAvailable <b>all episodes except 3</b>.",
        "video": "https://youtu.be/Dd_DTaMCZ-s"
      },
      {
        "title": "Hidden ruins upper right",
        "desc": "Open the gap between walls in the hidden ruins and wall jump to the upper doorway on the right.<br><br>\n        Follow the hidden path to an opening high above the ledge between the two mazes of the tricky ruins.<br><br>\n        Collect the coin at the exit. Note, this gives a way to reach the ledge between the mazes in <b>episode 1</b>.<br>\n        You can also reach the coin from the ledge below using the rocket or by hovering across from another ruin. <br><br>\n\t\tAvailable <b>all episodes except 3</b>.",
        "video": "https://youtu.be/kt0YFrvXjw0"
      },
      {
        "title": "Left ruins cubbyhole",
        "desc": "Go left from the start of the tricky ruins to a gap between two walls at the base of the cliff. This is directly below the hidden ruins. <br><br>\n        Wall jump to the top and enter the doorway on the left. Follow the hidden passage to a shallow opening in the cliff below where the lower left hidden ruins passage ends. (You can spray to open a cubbyhole here but it's empty.) <br><br>\n        Hop up to the hole and go in, you are bounced upward to the ledge above. take a moment to enjoy the view, then drop off the front of the ledge to land on a ledge above the openings from the hidden tunnels. <br><br>\n        spray the wall here to open two cubbyholes and get a coin from the one on the left. <br><br>\n\t\tAvailable <b>all episodes except 3</b>.",
        "video": "https://youtu.be/GoeBn6jGIok"
      },
      {
        "title": "Hidden ruins top cubbyhole (A)",
        "desc": "You need to get to the top of the hidden ruins.<br><br>\n        Follow the 'Left ruins cubbyhole' directions to the high ledge, the hop right and <i>hover</i> to the top opening where the coin is.<br><br>\n        Alternatively, open the gap between walls in the hidden ruins and wall jump all the way to the top. Come out to a ledge and do a series of back-flips to get to the top.<br>\n        Now spray the seven squares to open cubbyholes and get a coin each from the upper right and lower left (this one). What looks like a cubbyhole in the center here is actually a hole that ends on a ledge below. <br><br>\n\t\tAvailable <b>all episodes except 3</b>.",
        "video": "https://youtu.be/_e0uQkFxVIc"
      },
      {
        "title": "Hidden ruins top cubbyhole (B)",
        "desc": "You need to get to the top of the hidden ruins.<br><br>\n        Follow the 'Left ruins cubbyhole' directions to the high ledge, the hop right and <i>hover</i> to the top opening where the coin is.<br><br>\n        Alternatively, open the gap between walls in the hidden ruins and wall jump all the way to the top. Come out to a ledge and do a series of back-flips to get to the top.<br>\n        Now spray the seven squares to open cubbyholes and get a coin each from the upper right (this one) and lower left. What looks like a cubbyhole in the center here is actually a hole that ends on a ledge below. <br><br>\n\t\tAvailable <b>all episodes except 3</b>.",
        "video": "https://youtu.be/bhLmhAHX0SU"
      },
      {
        "title": "Lower pulley crevice",
        "desc": "Go up the right cliff face as you would in <b>episode 1</b>. When you reach the second basket, drop from the cliff and sidle along the crevice to the left.<br><br>\n        At the end of the crevice, spray the wall and part of it will retreat into the cliff leaving an opening you can hop into. Wall jump to collect the coin there. <br><br>\n        (There is an alternate route to the \"Hidden wall kicks\" coin here. Keep following the crevice left, down at an angle for a part, to land at the hole below the other coin.) <br><br>\n\t\tAvailable <b>all episodes except 3</b>.",
        "video": "https://youtu.be/rT89ZBeZCIA"
      },
      {
        "title": "Upper pulley crevice",
        "desc": "Go up the right cliff face as you would in <b>episode 1</b>. When you reach the top of the ramp that leads to the upper pulley wheel, drop off to a small ledge behind the wheel. <br><br>\n        Follow this ledge do an opening in the cliff, then sidle along the crevice to the left. At the end of the crevice, spray the wall and part of it will retreat into the cliff leaving an opening you can hop into. <br><br>\n        Hop up and drop to the lower part to get the coin. <br><br>\n\t\tAvailable <b>all episodes except 3</b>.",
        "video": "https://youtu.be/eGmkaXm4SLU"
      },
      {
        "title": "Tricky ruins M",
        "desc": "Go to the ledge between the first and second mazes in the tricky ruins. Locate the graffiti M on the right and wash it off for a blue coin.",
        "video": "https://youtu.be/RST2E3gQZVk"
      },
      {
        "title": "Paired circles (A)",
        "desc": "First, follow the directions for the \"Under the diving board\" coin and get the turbo nozzle. <br><br>\n        Locate the graffiti circle at the base of the right cliffs, then locate the corresponding circle behind and to the left of the boathouse. <br><br>\n        Wash one circle off to make a blue coin appear at the other circle, then quickly get to the other circle to collect the coin before it disappears. <br>\n        Turbo seems to be required to get the necessary speed. <br><br>\n\t\tAvailable <b>episode 6</b> only.",
        "video": "https://youtu.be/FEk6CNzSwtM"
      },
      {
        "title": "Paired circles (B)",
        "desc": "First, follow the directions for the 'Under the diving board' coin and get the turbo nozzle. <br><br>\n        Locate the graffiti circle behind and to the left of the boathouse, then locate the corresponding circle at the base of the right cliffs. <br><br>\n        Wash one circle off to make a blue coin appear at the other circle, then quickly get to the other circle to collect the coin before it disappears. <br>\n        Turbo seems to be required to get the necessary speed. <br><br>\n\t\tAvailable <b>episode 6</b> only.",
        "video": "https://youtu.be/oSMOmWPmw6g"
      },
      {
        "title": "Jars in the tomb (A)",
        "desc": "Enter the kings tomb (see the StrategyWiki's <b>episode 2</b> walk-through).<br><br>\n        Locate the two large jars stored in the walls and spray them with water to get a blue coin for each. Some of the smaller vases give you gold coins as well. <br><br>\n        You can exit through the window here to get back to the main area. <br><br>\n\t\tAvailable <b>all episodes except 1 and 3</b>.",
        "video": "https://youtu.be/MFherHv1oNE"
      },
      {
        "title": "Jars in the tomb (B)",
        "desc": "Enter the kings tomb (see the StrategyWiki's <b>episode 2</b> walk-through).<br><br>\n        Locate the two large jars stored in the walls and spray them with water to get a blue coin for each. Some of the smaller vases give you gold coins as well. <br><br>\n        You can exit through the window here to get back to the main area. <br><br>\n\t\tAvailable <b>all episodes except 1 and 3</b>.",
        "video": "https://youtu.be/8-UqUD2c6j0"
      }
    ],
    "title": "Gelato Beach",
    "link": "https://strategywiki.org/wiki/Super_Mario_Sunshine/Gelato_Beach_blue_coins"
  },
  "pp": {
    "coins": [
      {
        "title": "Baskets (A)",
        "desc": "There are six baskets scattered around the beach, all are upside-down and have a coin visible inside. The only time you can get at them is in <b>episode 2</b>. <br><br>\n        Stand on top and wait until one of the purple Bullet Bills starts to track you. Hop out of the way just before the bullet hits the basket (to avoid getting hurt). The bullet blows up the basket and you can get the coin. <br><br>\n        The black and gold bullets also blow up baskets but since they don't track you it's impossible to control where they land. <br><br>\n        With a couple of the harder to reach baskets you may have to stand nearby and then get the bullet to chase you to the basket. <br><br>\n\t\tVisible in all episodes but <b>only reachable in episode 2</b>.",
        "video": "https://youtu.be/WwK1CQjgpTg"
      },
      {
        "title": "Baskets (B)",
        "desc": "There are six baskets scattered around the beach, all are upside-down and have a coin visible inside. The only time you can get at them is in <b>episode 2</b>. <br><br>\n        Stand on top and wait until one of the purple Bullet Bills starts to track you. Hop out of the way just before the bullet hits the basket (to avoid getting hurt). The bullet blows up the basket and you can get the coin. <br><br>\n        The black and gold bullets also blow up baskets but since they don't track you it's impossible to control where they land. <br><br>\n        With a couple of the harder to reach baskets you may have to stand nearby and then get the bullet to chase you to the basket. <br><br>\n\t\tVisible in all episodes but <b>only reachable in episode 2</b>.",
        "video": "https://youtu.be/IFLxVqhM0KQ  "
      },
      {
        "title": "Baskets (C)",
        "desc": "There are six baskets scattered around the beach, all are upside-down and have a coin visible inside. The only time you can get at them is in <b>episode 2</b>. <br><br>\n        Stand on top and wait until one of the purple Bullet Bills starts to track you. Hop out of the way just before the bullet hits the basket (to avoid getting hurt). The bullet blows up the basket and you can get the coin. <br><br>\n        The black and gold bullets also blow up baskets but since they don't track you it's impossible to control where they land. <br><br>\n        With a couple of the harder to reach baskets you may have to stand nearby and then get the bullet to chase you to the basket. <br><br>\n\t\tVisible in all episodes but <b>only reachable in episode 2</b>.",
        "video": "https://youtu.be/wIJfiB73Xm4  "
      },
      {
        "title": "Baskets (D)",
        "desc": "There are six baskets scattered around the beach, all are upside-down and have a coin visible inside. The only time you can get at them is in <b>episode 2</b>. <br><br>\n        Stand on top and wait until one of the purple Bullet Bills starts to track you. Hop out of the way just before the bullet hits the basket (to avoid getting hurt). The bullet blows up the basket and you can get the coin. <br><br>\n        The black and gold bullets also blow up baskets but since they don't track you it's impossible to control where they land. <br><br>\n        With a couple of the harder to reach baskets you may have to stand nearby and then get the bullet to chase you to the basket. <br><br>\n\t\tVisible in all episodes but <b>only reachable in episode 2</b>.",
        "video": "https://youtu.be/Wq0svB8ZDEM  "
      },
      {
        "title": "Baskets (E)",
        "desc": "There are six baskets scattered around the beach, all are upside-down and have a coin visible inside. The only time you can get at them is in <b>episode 2</b>. <br><br>\n        Stand on top and wait until one of the purple Bullet Bills starts to track you. Hop out of the way just before the bullet hits the basket (to avoid getting hurt). The bullet blows up the basket and you can get the coin. <br><br>\n        The black and gold bullets also blow up baskets but since they don't track you it's impossible to control where they land. <br><br>\n        With a couple of the harder to reach baskets you may have to stand nearby and then get the bullet to chase you to the basket. <br><br>\n\t\tVisible in all episodes but <b>only reachable in episode 2</b>.",
        "video": "https://youtu.be/QagmURUrqFQ  "
      },
      {
        "title": "Baskets (F)",
        "desc": "There are six baskets scattered around the beach, all are upside-down and have a coin visible inside. The only time you can get at them is in <b>episode 2</b>. <br><br>\n        Stand on top and wait until one of the purple Bullet Bills starts to track you. Hop out of the way just before the bullet hits the basket (to avoid getting hurt). The bullet blows up the basket and you can get the coin. <br><br>\n        The black and gold bullets also blow up baskets but since they don't track you it's impossible to control where they land. <br><br>\n        With a couple of the harder to reach baskets you may have to stand nearby and then get the bullet to chase you to the basket. <br><br>\n\t\tVisible in all episodes but <b>only reachable in episode 2</b>.",
        "video": "https://youtu.be/V8KX2fnfbY0  "
      },
      {
        "title": "Pirate ship ramp",
        "desc": "Enter the park and go to the start of the pirate ship ride, see the walk-through for <b>episode 3</b>. <br><br>\n        At the ramp, instead of boarding a ship, drop into the water and find the blue coin floating inside the ramp support. To get it, hop up from the water and start <i>hover</i>ing until you reach the coin. <br><br>\n        Moving around might be better than <i>hover</i>ing straight up. This may require several tries but you can ground pound right before falling to get the last bit of height. So this one is largely a matter of persistence. <br><br>\n\t\tAvailable <b>all episodes except 2 and 4</b>.",
        "video": "https://youtu.be/z8VPFb8omIg "
      },
      {
        "title": "Pirate ship cage",
        "desc": "Enter the park and from the ride staircase that leads up to the two rocking ships, jump across to the second ship and ride it up to the left as in the <b>episode 3</b> coin hunt. <br><br>\n        When it has enough momentum to reach the platform above grated box, stand near the front, hop and <i>hover</i> over to it. Pound the gate in front to get inside the cage and collect the coin there. <br><br>\n        It's likely you will get this coin without going out of your way in <b>episode 3</b>. <br><br>\n\t\tAvailable <b>all episodes except 2 and 4</b>.",
        "video": "https://youtu.be/OGo7ShUrNFE  "
      },
      {
        "title": "Pirate ship platform",
        "desc": "From the cage mentioned in the \"Pirate ship cage\" coin, get to the top of the cage. You now need to get to the platform directly overhead.<br><br>\n        Wait until the pirate ship is about to make one of its complete turns (this happens every three swings), then hop on the front end of the hull for a boost, hop off, and <i>hover</i> to the platform. <br><br>\n        Don't worry if you don't do it the first time since this one of the more difficult pieces of acrobatics in the game. It looks like it would be easier to jump onto the square tip of the bow, but the hull is a lot easier to land on and you probably won't slip off.<br><br>\n        Once on the platform get the coin which is just sitting there. <br><br>\n\t\tAvailable <b>all episodes except 2 and 4</b>.",
        "video": "https://youtu.be/mf9VnX-x-zI  "
      },
      {
        "title": "Pirate ship frame",
        "desc": "From the top of the cage Pirate ship cage section, look carefully at the green frame that's holding up the ships. <br>\n        On the near corner on the right notice a blue coin. <br><br>\n        Hop and <i>hover</i> over to it. <br><br>\n\t\tAvailable <b>all episodes except 2 and 4</b>.",
        "video": "https://youtu.be/Nang71-J5eg  "
      },
      {
        "title": "Above pirate ships",
        "desc": "Get to the platform where you collect the shine in <b>episode 3</b>, (see the StrategyWiki walk-through for that episode.)<br><br>\n        You can spot the coin floating a bit below to the right. Hop and <i>hover</i> until you're over it, then drop to collect it.<br><br>\n        You will probably land in the water so don't worry about falling. <br><br>\n\t\tAvailable <b>all episodes except 2 and 4</b>.",
        "video": "https://youtu.be/KjCKpqWyuZs  "
      },
      {
        "title": "Roller coaster",
        "desc": "Enter the park, go right past the clam shells and under the orange arch. Continue up the slope until you reach a gazebo with a blue roof. <br><br>\n        Starting in <b>episode 5</b> there is a bridge that leads from here to the start of the roller coaster ride, but in episodes 1 and 3 you can hop and <i>hover</i> over the gap where the bridge would be.<br><br>\n        <i>hover</i> around to the ledge in back to find a coin. <br><br>\n\t\tAvailable <b>all episodes except 2 and 4</b>.",
        "video": "https://youtu.be/RCtJkn5sscs "
      },
      {
        "title": "Arch M",
        "desc": "Enter the park, go right past the clam shells and find a graffiti M on the left side on the orange arch. Wash off the M and a blue coin pops out. <br><br>\n\t\tAvailable <b>all episodes except 2 and 4</b>.",
        "video": "https://youtu.be/R9TlqMnE3lQ  "
      },
      {
        "title": "Fountain M",
        "desc": "Enter the park, go left past the merry-go-round and reflecting pool, then follow the ramp to the fountain behind the Ferris wheel. <br><br>\n        This is where you're supposed to climb grates and fight koopas in <b>episode 5</b>. <br>\n        Check the far wall, above the block that sticks out, to find a graffiti M high above the ground. Wash it off for a coin. <br><br>\n\t\tAvailable <b>all episodes except 2 and 4</b>.",
        "video": "https://youtu.be/F3YC2NNGxbI "
      },
      {
        "title": "Park rear M",
        "desc": "Enter the park, go left past the merry-go-round and reflecting pool, then drop to a sandy area behind the pool. <br>\n        Check the wall near the tree there to find a graffiti M. <br><br>\n\t\tAvailable <b>all episodes except 2 and 4</b>.",
        "video": "https://youtu.be/6CrILI9ZB-U "
      },
      {
        "title": "Paired crosses (A)",
        "desc": "Enter the park and locate a cross on the tree next to the path leading to the gazebo, the tree resembles a giant Pianta head. <br>\n        Then locate a corresponding graffiti cross on the right side of the wall between the pirate ride and the reflecting pool. <br><br>\n        Wash one cross off to make a blue coin appear at the other cross, then quickly get to the other cross to collect the coin before it disappears. <i>hover</i> across the pool under the pirate ride, quickly hopping out to continue <i>hover</i>ing when you fall in. <br><br>\n\t\tAvailable <b>all episodes except 2 and 4</b>.",
        "video": "https://youtu.be/S3mwDRQecdk  "
      },
      {
        "title": "Paired crosses (B)",
        "desc": "Enter the park and locate the graffiti cross on the right side of the wall between the pirate ride and the reflecting pool. <br>\n        Then locate a corresponding cross on the tree next to the path leading to the gazebo, the tree resembles a giant Pianta head. <br><br>\n        Wash one cross off to make a blue coin appear at the other cross, then quickly get to the other cross to collect the coin before it disappears. <i>hover</i> across the pool under the pirate ride, quickly hopping out to continue <i>hover</i>ing when you fall in. <br><br>\n\t\tAvailable <b>all episodes except 2 and 4</b>.",
        "video": "https://youtu.be/cCDI0M999k8  "
      },
      {
        "title": "Paired triangles (A)",
        "desc": "Locate the graffiti triangle on the wall above a small ledge behind the pirate ride, then follow the ramp leading from the gazebo to locate the corresponding triangle on a wall near where people would board the Ferris wheel. <br><br>\n        Wash the graffiti and rush to get the coins. To get from the upper location to the lower one just drop down ledges, but to go the other direction you need to do some fast back-flips. <br><br>\n\t\tAvailable <b>all episodes except 2 and 4</b>.",
        "video": "https://youtu.be/VOqJOKsvbgc "
      },
      {
        "title": "Paired triangles (B)",
        "desc": "Locate the triangle on a wall near where people would board the Ferris wheel, then follow the ramp down leading to the gazebo to locate the corresponding triangle on the wall above a small ledge behind the pirate ride. <br><br>\n        Wash the graffiti and rush to get the coins. To get from the upper location to the lower one just drop down ledges, but to go the other direction you need to do some fast back-flips. <br><br>\n\t\tAvailable <b>all episodes except 2 and 4</b>.",
        "video": "https://youtu.be/NcPpZ6Lkf-k "
      },
      {
        "title": "Paired circles (A)",
        "desc": "Get to the top of the Ferris wheel, (see the <b>episode 5</b> StrategyWiki walk-through) and locate the graffiti circles on the left and right. <br><br>\n        Wash and get to the other location for a coin each. This time the symbols are fairly close together so it's more a matter of not falling off here. <br><br>\n\t\tAvailable <b>all episodes except 2 and 4</b>.",
        "video": "https://youtu.be/apwTZuuRsXM "
      },
      {
        "title": "Paired circles (B)",
        "desc": "Get to the top of the Ferris wheel, (see the <b>episode 5</b> StrategyWiki walk-through) and locate the graffiti circles on the left and right. <br><br>\n        Wash and get to the other location for a coin each. This time the symbols are fairly close together so it's more a matter of not falling off here. <br><br>",
        "video": "https://youtu.be/eiFGS6bIqXc "
      },
      {
        "title": "Sand icon (A)",
        "desc": "There are two spots on the beach where washing the sand reveals a blue shine icon. Keep washing and a blue coin pops out when the icon is complete. <br><br>\n        Keep watching for sparks in the sand to find these, since you will be spraying the sand to find fruit and coins anyway. Both are located in front of the sunflower area. <br><br>\n\t\t<b>Appears in all episodes.</b>",
        "video": "https://youtu.be/A51DHWzH8sU "
      },
      {
        "title": "Sand icon (B)",
        "desc": "There are two spots on the beach where washing the sand reveals a blue shine icon. Keep washing and a blue coin pops out when the icon is complete. <br><br>\n        Keep watching for sparks in the sand to find these, since you will be spraying the sand to find fruit and coins anyway. Both are located in front of the sunflower area. <br><br>\n\t\t<b>Appears in all episodes.</b>",
        "video": "https://youtu.be/oB7fViAN6OU "
      },
      {
        "title": "Blue parrot (A)",
        "desc": "There are two blue parrots in this level that each turn into a blue coin when sprayed. <br><br>\n        This one likes to perch near the gazebo. Wait in this location and spray the birds that come close until you get it. <br><br>\n\t\tAvailable <b>all episodes except 2 and 4</b>.",
        "video": "https://youtu.be/zMjWvU6VQYU "
      },
      {
        "title": "Blue parrot (B)",
        "desc": "There are two blue parrots in this level that each turn into a blue coin when sprayed. <br><br>\n        This one likes to perch near the merry-go-round. Wait in this location and spray the birds that come close until you get it.",
        "video": "https://youtu.be/4zSztNMV4Ck "
      },
      {
        "title": "Clam shell",
        "desc": "Go to the clam shell ride and spray the green clam shell until opens. Grab the coin before the shell closes again. <br><br>\n\t\tAvailable <b>all episodes except 2 and 4</b>.",
        "video": "https://youtu.be/mBqPHOggSQg "
      },
      {
        "title": "Tower of Stus",
        "desc": "Enter the park and go past the merry-go-round to the reflecting pool. Check to the right to find a stack of Stus (round creatures with short legs). <br><br>\n        Spray off the ones on the big one, then hop on top of the big one to defeat it and get a coin. <br>(Or ground pound the whole stack in one go :P) <br><br>\n\t\tAvailable <b>all episodes except 2 and 4</b>.",
        "video": "https://youtu.be/go3jqzuARoU "
      },
      {
        "title": "Beach Butterfly (A)",
        "desc": "Get Yoshi and hunt for butterflies in the sunflower area. <br><br>\n        Fruit can be found by spraying the sand, but it may take a while to find the type of fruit needed to wake up the egg.<br><br>\n        Have Yoshi eat two of blue butterflies to get a blue coin for each. <br><br>\n        Yoshi appears in all episodes here, but only after clearing <b>episode 5</b>. ",
        "video": "https://youtu.be/H_KP0I88isg  "
      },
      {
        "title": "Beach Butterfly (B)",
        "desc": "Get Yoshi and hunt for butterflies in the sunflower area. <br><br>\n        Fruit can be found by spraying the sand, but it may take a while to find the type of fruit needed to wake up the egg.<br><br>\n        Have Yoshi eat two of blue butterflies to get a blue coin for each. <br><br>\n        Yoshi appears in all episodes here, but only after clearing <b>episode 5</b>.",
        "video": "https://youtu.be/XaDzXS0M750  "
      },
      {
        "title": "Park Butterfly",
        "desc": "Get Yoshi and hunt for butterflies on the park beach to the left of the merry-go-round. <br><br>\n        Yoshi is only found in <b>episode 6</b> here. Yoshi is behind the Pianta shaped tree. <br>\n        (For some reason Yoshi doesn't come with you when you enter the park.  ",
        "video": "https://youtu.be/OXvSa1D_pQ4  "
      }
    ],
    "title": "Pinna Park",
    "link": "https://strategywiki.org/wiki/Super_Mario_Sunshine/Pinna_Park_blue_coins"
  },
  "pv": {
    "coins": [
      {
        "title": "West lawn",
        "desc": "Go left from bridge at the start and follow the path around the corner. There is a grassy area on the left with five wells that take you to the village underside. <br><br>\n        Check the edge, behind a small tree, to find a coin. <br><br>\n\t\t<b>Appears all episodes.</b>",
        "video": "https://youtu.be/QXT0eBjLvuo"
      },
      {
        "title": "East bridge",
        "desc": "Go right from bridge at the start and follow the path around the corner. <br><br>\n        Continue until the bridge crosses the stream (night) or dry bed (day), then check under the bridge for a coin. <br><br>\n\t\t<b>Appears all episodes.</b>",
        "video": "https://youtu.be/L6yzqXJbZk4"
      },
      {
        "title": "Stream outlet",
        "desc": "From the \"East bridge\" coin location follow the stream/dry bed left to a small gate where the stream spills out when it's flowing. <br><br>\n        You will find a coin in front of that gate. <br><br>\n\t\t<b>Appears all episodes.</b>",
        "video": "https://youtu.be/DXED3vwKCyY"
      },
      {
        "title": "Northwest tree",
        "desc": "Go left from bridge at the start and follow the path to the hot spring. Go up the trunk of the giant tree to the left of it and find a blue coin at the crown. <br><br>\n\t\t<b>Appears all episodes.</b>",
        "video": "https://youtu.be/2rqJboVVb_k"
      },
      {
        "title": "Southwest tree",
        "desc": "Go left from bridge at the start and follow the path to the corner. Go up the trunk of the tree just past it to the crown, then follow the leaf stem on the left to the end of the leaf. <br><br>\n        There is a blue coin sitting on a little ledge to the right. <br><br>\n\t\t<b>Appears all episodes.</b>",
        "video": "https://youtu.be/MdHB01MFdb0"
      },
      {
        "title": "Start M",
        "desc": "At the start, immediately turn around to find a graffiti M on the cliff face behind you. Wash it off to get a coin. <br><br>\n\t\t<b>Appears all episodes.</b>",
        "video": "https://youtu.be/9cEiej2-DaE"
      },
      {
        "title": "Pond M",
        "desc": "Bear right from bridge at the start and locate the larger wicker structure behind a red mushroom and in front of the pond (or the dry lake bed daytime). <br><br>\n        There is a graffiti M on the front side, wash it off to get a coin. <br><br>\n\t\t<b>Appears all episodes.</b>",
        "video": "https://youtu.be/2CnRA2NaT80"
      },
      {
        "title": "Fruit tree M",
        "desc": "Bear left from bridge at the start and locate the plateau with the fruit tree and a red mushroom. <br><br>\n        There is a graffiti M on the front side, wash it off to get a coin. <br><br>\n\t\t<b>Appears all episodes.</b>",
        "video": "https://youtu.be/0k3c2jWiqh0"
      },
      {
        "title": "Underside M",
        "desc": "Bear right from bridge at the start and locate a well to the underside next to a red mushroom. <br><br>\n        Ground pound the gate to get through. Look around for a sliding grate, climb onto it and ride to another section. (If you've completed <b>episode 3</b> then you've already gotten used to doing this kind of thing.) <br><br>\n        Make a U-turn to the left and follow the grate to a swing, then drop and <i>hover</i> to a vertical grate in front of you. (Alternatively, drop to the swing and hop from the swing to the vertical grate.)<br><br>\n        Climb to the top of the grate, immediately turn around and <i>hover</i> over to the top of the grate you were just under. Hop to the section on the right, this is a ledge around the well you came through at the start. Go around behind the well and adjust the camera to look above you to find a graffiti M. Wash it off to get a coin. <br><br>\n        To get back to civilization, follow the path until it turns to the left, then <i>hover</i> straight across to another section. Go right and slowly go over the edge to a vertical grate. Flip the gate to the other side, the go up to the underside of the section you were just on. Ride the sliding grate here to the underside of the section with the well. <br>\n        Get the gate and flip it, then wall jump out the well to end up where you started. Note, the M is there even at night, though it's nearly impossible to see, so it's better to do this in the daytime episodes. <br><br>\n\t\t<b>Appears all episodes.</b>",
        "video": "https://youtu.be/FoQCQ3L6iIM"
      },
      {
        "title": "Paired triangles (A)",
        "desc": "Locate the graffiti triangle on the end of the wall in front of the hot spring. <br>\n        Then follow the path right from the hot spring to an area with lots of little yellow mushrooms. Across the path from those locate the corresponding triangle on a cliff face.<br><br>\n        Wash the graffiti from one triangle to make a coin pop out at the other triangle, then get to the other location before it disappears. The symbols are close enough together so that it should be no problem to reach the coins in time, but using the slip-slide move may help. <br><br>\n\t\t<b>Appears all episodes.</b>",
        "video": "https://youtu.be/zsujNb1u65k"
      },
      {
        "title": "Paired triangles (B)",
        "desc": "Locate the graffiti triangle on the end of the wall in front of the hot spring. <br>\n        Then follow the path right from the hot spring to an area with lots of little yellow mushrooms. Across the path from those locate the corresponding triangle on a cliff face.<br><br>\n        Wash the graffiti from one triangle to make a coin pop out at the other triangle, then get to the other location before it disappears. The symbols are close enough together so that it should be no problem to reach the coins in time, but using the slip-slide move may help. <br><br>\n\t\t<b>Appears all episodes.</b>",
        "video": "https://youtu.be/ak819lGezYQ"
      },
      {
        "title": "M by the Mayor",
        "desc": "When you recover FLUDD in <b>episode 3</b> (see the walk-through for that episode), check the platform next to you to find a graffiti M under it. <br><br>\n        Wash it off to get a coin. <br><br>\n\t\tAppears <b>episode 3</b> only.",
        "video": "https://youtu.be/17n24Btg9OI"
      },
      {
        "title": "M under the goop",
        "desc": "Once you get FLUDD in <b>episode 3</b>, make your way back to the bridge near the start. <br><br>\n        Wash the section of lawn immediately across the path from the bridge to reveal a graffiti M. Wash it off to get a coin. <br><br>\n\t\tAppears <b>episode 3</b> only.",
        "video": "https://youtu.be/7G0SZpFZmwU"
      },
      {
        "title": "Waterfall",
        "desc": "Spray the top of the waterfall coming out of the central tree trunk, or spray the hole if it's daytime. A coin pops out. <br><br>\n\t\t<b>Appears all episodes.</b>",
        "video": "https://youtu.be/Pcg3mVN-A94"
      },
      {
        "title": "Wash the sign",
        "desc": "Wash the sign, which is near the end of the bridge as you enter, in order to get this coin. <br><br>\n        The sign, which tells you about the hot spring, appears only in the daytime. <br><br>\n\t\tAppears <b>episodes 2, 4, 6 and 8</b> (day time).",
        "video": "https://youtu.be/CoCuqUaJG-o"
      },
      {
        "title": "Wash the moon",
        "desc": "Stand on the golden mushroom where the mayor was in <b>episode 3</b>. <br><br>\n        Switch the camera to over-the-shoulder view, look at the moon and start spraying. When you hit the right spot a coin pops out. <br><br>\n        This is one the best hidden coins in the game, but there is a rather oblique hint. In <b>episode 8</b> talk to the Pianta lady in the lavender top, she's dancing to the right of the main group. <br>\n        She talks about the mayor's wife's secret stash, referring to one of the secret shines on this level, and then mentions that the mayor may also have a stash. <br>\n        So if you were able to solve the puzzle for the secret shine maybe you're supposed to do something similar with the mayor. <br>\n        Does not appear in the daytime since the moon isn't visible. <br><br>\n\t\tAppears <b>episodes 1, 3, 5 and 7</b> (night time).",
        "video": "https://youtu.be/5ZTGgPliJqU"
      },
      {
        "title": "Douse the backpack",
        "desc": "Once you get FLUDD in <b>episode 3</b>, make your way to the pond then follow the stream until it ends. In the area to the right there is a Pianta whose backpack is on fire. <br><br>\n        Chase him around with your <i>squirt nozzle</i> going until you put the fire out, then talk to him to get a blue coin as a reward. <br><br>\n\t\tAppears <b>episode 3</b> only.",
        "video": "https://youtu.be/zlubhTbE88Q"
      },
      {
        "title": "Rescue villager (A)",
        "desc": "After you rescue the ten villagers from the goop, talk to each one. The two kids just say thanks but the other eight give you a blue coin as a reward. <br><br>\n\t\tAppears <b>episode 6 only</b>.",
        "video": "https://youtu.be/AFwudi_3egM"
      },
      {
        "title": "Rescue villager (B)",
        "desc": "After you rescue the ten villagers from the goop, talk to each one. The two kids just say thanks but the other eight give you a blue coin as a reward. <br><br>\n\t\tAppears <b>episode 6 only</b>.",
        "video": "https://youtu.be/zPBJqbKBN64"
      },
      {
        "title": "Rescue villager (C)",
        "desc": "After you rescue the ten villagers from the goop, talk to each one. The two kids just say thanks but the other eight give you a blue coin as a reward. <br><br>\n\t\tAppears <b>episode 6 only</b>.",
        "video": "https://youtu.be/zPBJqbKBN64"
      },
      {
        "title": "Rescue villager (D)",
        "desc": "After you rescue the ten villagers from the goop, talk to each one. The two kids just say thanks but the other eight give you a blue coin as a reward. <br><br>\n\t\tAppears <b>episode 6 only</b>.",
        "video": "https://youtu.be/Oddiyth-20A"
      },
      {
        "title": "Rescue villager (E)",
        "desc": "After you rescue the ten villagers from the goop, talk to each one. The two kids just say thanks but the other eight give you a blue coin as a reward. <br><br>\n\t\tAppears <b>episode 6 only</b>.",
        "video": "https://youtu.be/rVJkfXLfBEc"
      },
      {
        "title": "Rescue villager (F)",
        "desc": "After you rescue the ten villagers from the goop, talk to each one. The two kids just say thanks but the other eight give you a blue coin as a reward. <br><br>\n\t\tAppears <b>episode 6 only</b>.",
        "video": "https://youtu.be/ryzZaKSqktk"
      },
      {
        "title": "Rescue villager (G)",
        "desc": "After you rescue the ten villagers from the goop, talk to each one. The two kids just say thanks but the other eight give you a blue coin as a reward. <br><br>\n\t\tAppears <b>episode 6 only</b>.",
        "video": "https://youtu.be/gHBZq2ZePFI"
      },
      {
        "title": "Rescue villager (H)",
        "desc": "After you rescue the ten villagers from the goop, talk to each one. The two kids just say thanks but the other eight give you a blue coin as a reward. <br><br>\n\t\tAppears <b>episode 6 only</b>.",
        "video": "https://youtu.be/hpe065yh99M"
      },
      {
        "title": "Blue parrot",
        "desc": "Get to the top level of shelf fungi on the central trunk, the same ledge as the <i>rocket nozzle</i> crate. <br><br>\n        There is a blue parrot that occasionally perches there. <br>\n        Spray it every time it comes near until it turns into a blue coin. <br><br>\n\t\tAppears <b>episode 8</b> only.",
        "video": "https://youtu.be/5iHsKDAd_QA"
      },
      {
        "title": "Pound the Pianta",
        "desc": "Find the Pianta statue at the back of the hot spring. In the daytime, when there is water coming out of his nose, you cannot get this coin. <br><br>\n        At night, stand on top and do a ground pound to make a blue coin and about a dozen gold coins come out. This is another well hidden coin, unless you like pounding on random objects. <br><br>\n\t\tAppears <b>episodes 1, 3, 5 and 7</b> (night time).",
        "video": "https://youtu.be/7DkXhgacjZM"
      },
      {
        "title": "Beehive (A)",
        "desc": "There are two beehives on this level, deal with them just like the beehives in Bianco Hills and Gelato beach. <br><br>\n        This one is located behind the giant tree to the left of the hot spring. These have more bees than the hives in the other levels. <br><br>\n        Fruit of all types is found growing in a tree on a plateau across the path from the hot spring.<br><br>\n        Yoshi only appears in <b>episode 5</b>.",
        "video": "https://youtu.be/JbCfY5SptAQ"
      },
      {
        "title": "Beehive (B)",
        "desc": "There are two beehives on this level, deal with them just like the beehives in Bianco Hills and Gelato beach. <br><br>\n        This one is located over the end of the bridge. These have more bees than the hives in the other levels. <br><br>\n        Fruit of all types is found growing in a tree on a plateau across the path from the hot spring.<br><br>\n        Yoshi only appears in <b>episode 5</b>.",
        "video": "https://youtu.be/y6x5uYCBMlo"
      },
      {
        "title": "Butterflies",
        "desc": "Get Yoshi and go back to the fruit tree, hop on top and from there to the top of the red mushroom next to it.<br><br>\n        Fruit of all types is found growing in a tree on a plateau across the path from the hot spring. Have Yoshi eat all the blue butterflies and a blue coin appears. <br><br>\n        Yoshi only appears in <b>episode 5</b>. ",
        "video": "https://youtu.be/stLB2hvMZo4"
      }
    ],
    "title": "Pianta Village",
    "link": "https://strategywiki.org/wiki/Super_Mario_Sunshine/Pianta_Village_blue_coins"
  },
  "rh": {
    "coins": [
      {
        "title": "Sea floor",
        "desc": "Check the bottom of the ocean under the orange platform with an arrow, to the right of the ship with grates. There are four gold coins around a blue coin. <br><br>\n\t\t<b>Appears in all episodes.</b>",
        "video": "https://youtu.be/hRRwm1h_eYg"
      },
      {
        "title": "Above the sea",
        "desc": "Go to the open water near the red flags, away from the ships but not as far as the metal platforms. There is a blue coin along with a number of gold coins in the air above the water. <br><br>\n        Easiest to reach with the <i>rocket nozzle</i> but can also be reached by jumping with the turbo attachment or a racing blooper. <br><br>\n\t\tVisible in <b>all episodes</b> but only reachable starting <b>episode 2</b>.",
        "video": "https://youtu.be/JSwXNEL48po"
      },
      {
        "title": "Tower scaffolding",
        "desc": "Check the lower level of scaffolding between the tower and the ledge with the buildings. There is a blue coin with gold coins on either side. <br><br>\n        Easy to reach with a <i>rocket nozzle</i> but you can also <i>hover</i> to it from the ledge nearby. <br><br>\n\t\t<b>Appears in all episodes.</b>",
        "video": "https://youtu.be/EsuOU2-O6R0"
      },
      {
        "title": "Tower coin stack",
        "desc": "Go to the top of the tower and fire the rocket to collect gold coins and a blue coin at the top. You may have to hop just before the rocket goes off to get the extra few feet of altitude needed. <br><br>\n\t\tVisible in <b>all episodes</b> but only reachable when you get the <i>rocket nozzle</i> starting <b>episode 3</b>.",
        "video": "https://youtu.be/SelbmUnK98w"
      },
      {
        "title": "Above the fountain",
        "desc": "Check above the fountain on the ledge with the buildings to find a blue coin floating in the air. Use back-flip + <i>hover</i> or some other combination to reach. <br><br>\n\t\t<b>Appears in all episodes.</b>",
        "video": "https://youtu.be/7o1l9B7ROMs"
      },
      {
        "title": "Blooper trail",
        "desc": "Follow the trail of coins that leads to the blooper race track and hop when you get close to the blue coin near the end. <br><br>\n\t\tAppears in <b>episode 2 only</b>.",
        "video": "https://youtu.be/UKShq3pz9BI"
      },
      {
        "title": "Crane top",
        "desc": "Check the top of the first crane moving the platform next to the ship. There is a blue coin with two gold coins in either side. <br><br>\n        Easy to reach with the <i>rocket nozzle</i> but you can also get it by <i>hover</i>ing from the top of the ship's smokestack. <br><br>\n\t\t<b>Appears in all episodes.</b>",
        "video": "https://youtu.be/6MdxW4Qe8Fw"
      },
      {
        "title": "Lower catwalk",
        "desc": "Check lower level of catwalks to find a blue coin next to two gold coins almost directly above the crane at end of a beam. <br><br>\n        To reach with the <i>rocket nozzle</i>, fire from the grates on the ship to reach the pink grate structure above. Hop east (toward the buildings) to the scaffolding, go right and drop to land on the beam with the coins. <br><br>\n        Alternatively, try walking the beam connecting the ledge with buildings to the catwalks, then <i>hover</i>ing to the beam with the coins. <br><br>\n\t\t<b>Appears in all episodes.</b>",
        "video": "https://youtu.be/QbiK7dLarCI"
      },
      {
        "title": "Middle catwalk",
        "desc": "Check the middle level of catwalks to find a blue coin next to two gold coins over the water next to the cement mixer area. <br><br>\n        To reach with the <i>rocket nozzle</i>, follow the same directions as with the lower catwalk coin, but instead of going right go straight and follow the beam to the end. <br>\n        This coin can be reached without the <i>rocket nozzle</i> but it's more difficult. <br><br>\n\t\t<b>Appears in all episodes.</b>",
        "video": "https://youtu.be/YA8mK9JBMKc"
      },
      {
        "title": "Catwalk drop",
        "desc": "Check the southern part of the catwalks to find a column of coins below the end of a beam. <br><br>\n        To reach with the <i>rocket nozzle</i>, hop and fire at the base of the beam's support, you should get enough of a lift to get the blue coin but not all of the gold coins. <br><br>\n        Alternatively, walk the beam connecting the ledge with buildings to the catwalks, continue in the same direction and ride the lift to the next higher level. Continue, <i>hover</i>ing around the crane and a beam, to reach the beam with the coins. <br>\n        When you reach the end of the beam just drop off to collect them. <br><br>\n\t\t<b>Appears in all episodes.</b>",
        "video": "https://youtu.be/5oD3ihAtXEg"
      },
      {
        "title": "Right of warehouse M",
        "desc": "Check the right side of the building with three large doors at the start. Clean off the graffiti M for a coin. <br><br>\n\t\t<b>Appears in all episodes.</b>",
        "video": "https://youtu.be/aZOtfTsIwmE"
      },
      {
        "title": "Above warehouse M",
        "desc": "Check the wall above the building with three large doors at the start for a graffiti M. <br><br>\n        This is much easier to reach in <b>episodes 2 and 6</b> because there are large crates in front of the building, but in other episodes it can still be reached with back-flip/wall-jump combos. <br><br>\n\t\t<b>Appears in all episodes.</b>",
        "video": "https://youtu.be/DY77FhHXUSw"
      },
      {
        "title": "Ship deck M",
        "desc": "Check the deck inside the grates of the ship in front of the start. <br><br>\n        You may have to clean some blooper ink off first but you should be able to spot a graffiti M. <br><br>\n\t\tAppears in <b>episode 1 only</b>.",
        "video": "https://youtu.be/gHTESBrHLFU"
      },
      {
        "title": "Ship side M",
        "desc": "Check the left side of the same ship for a graffiti M in red. <br><br>\n\t\t<b>Appears in all episodes.</b>",
        "video": "https://youtu.be/WNskySCdGUE"
      },
      {
        "title": "Tower base M",
        "desc": "Wash the squid ink off the ground between the tower and the ship to reveal a graffiti M. <br><br>\n\t\tAppears in <b>episode 1 only</b>.",
        "video": "https://youtu.be/vviLCXfs68Y"
      },
      {
        "title": "Building front M",
        "desc": "On a building just past the fountain, across from the crane, locate a graffiti M. <br><br>\n\t\t<b>Appears in all episodes.</b>",
        "video": "https://youtu.be/jWW1ELFZIj0"
      },
      {
        "title": "Above buildings M",
        "desc": "Check for a graffiti M on the wall above the building at the end of the curved elevated path across from the helipad. <br><br>\n        Can be reached easily with the rocket or you can <i>hover</i> to it going from the fruit towers to the elevated path then to the top of the building. <br><br>\n\t\t<b>Appears in all episodes.</b>",
        "video": "https://youtu.be/VXrQq_58hq8"
      },
      {
        "title": "Paired crosses (A)",
        "desc": "Locate a graffiti cross on the front of one of the buildings near the fruit towers. Locate a corresponding cross on the side of the tower.<br><br>\n        Wash one cross off to make a blue coin appear at the other cross, then quickly get to the other cross to collect the coin before it disappears.<br><br>\n        It seems to be impossible to get both of these without the <i>turbo nozzle</i> which can't be activated until <b>episode 7</b>, though once activated you can get it as early as <b>episode 4</b>. <br>\n        The crosses are visible in all episodes even though it's not always possible to get the coins.",
        "video": "https://youtu.be/2TyMaGFiMq8"
      },
      {
        "title": "Paired crosses (B)",
        "desc": "Locate a graffiti cross on the side of the tower. Locate a corresponding cross on the front of one of the buildings near the fruit towers.<br><br>\n        Wash one cross off to make a blue coin appear at the other cross, then quickly get to the other cross to collect the coin before it disappears.<br><br>\n        It seems to be impossible to get both of these without the <i>turbo nozzle</i> which can't be activated until <b>episode 7</b>, though once activated you can get it as early as <b>episode 4</b>. <br>\n        The crosses are visible in all episodes even though it's not always possible to get the coins.",
        "video": "https://youtu.be/v6Jqm1uopqU"
      },
      {
        "title": "Metal platform M",
        "desc": "Check the top of the tall metal platforms in the area of the ocean farthest from the start for a graffiti M. <br><br>\n        To reach this with the rocket, first shoot to a lower platform nearby and then use the rocket to hop to the higher ones. <br><br>\n        Alternatively, do a series of <i>hover</i>s starting from the ledge with building and following the small ledges on the cliff to the platforms. <br><br>\n\t\t<b>Appears in all episodes.</b>",
        "video": "https://youtu.be/9FkpK5MaMDQ"
      },
      {
        "title": "Far cliff M",
        "desc": "Find the ledge on the rightmost cliff, almost as far as you can get from the start, and check the wall for a graffiti M.<br><br>\n        This can be reached easily with the rocket or you can do a series of <i>hover</i>s similar to those for the metal platform M.<br><br>\n        Alternatively, in <b>episode 8</b>, the Pianta on the platform by the yellow submarine will throw you there if you talk to him. <br><br>\n\t\t<b>Appears in all episodes.</b>",
        "video": "https://youtu.be/OvP4idfupb4"
      },
      {
        "title": "Wall icon",
        "desc": "Go to the wall to the left of the cement mixing area that is to the left of the brown box. <br><br>\n        Spray around the middle right area of the wall. Gold coins pop out and a blue shine icon is gradually revealed. <br>\n        A blue coin pops out when the icon is completely visible. <br><br>\n\t\t<b>Appears in all episodes.</b>",
        "video": "https://youtu.be/2zR7FBB4gE8"
      },
      {
        "title": "Fish basket",
        "desc": "Spray the baskets of fish in the middle of the market at the far end of the ledge with houses. <i>hover</i> over the baskets for best results. <br><br>\n\t\tAppears starting <b>episode 6</b>.",
        "video": "https://youtu.be/HkKwKV8k7IM"
      },
      {
        "title": "Raise sub",
        "desc": "Locate the white propeller with a red sun logo above the sub. Spray to raise the submarine all the way up out of the water and blue coin pops out. <br><br>\n\t\tAppears in <b>episode 1 only</b>.",
        "video": "https://youtu.be/TvP_xpDmZU4"
      },
      {
        "title": "Tower crate",
        "desc": "Smash the crate sitting next to the tower to make a coin pop out. <br><br>\n\t\t<b>Appears in all episodes.</b>",
        "video": "https://youtu.be/hOxJlCiPric"
      },
      {
        "title": "Cage blooper",
        "desc": "Enter the cage that held the shine in <b>episode 3</b>. Defeat the blooper there and it drops a blue coin.<br><br>\n        With the rocket you can enter the cage easily by launching from the platform below. Without the rocket you essentially have to re-do episode 3 to reach it. <br><br>\n\t\tAppears starting <b>episode 4</b>.",
        "video": "https://youtu.be/RHX8GK7vtM4"
      },
      {
        "title": "Ship spiders (A)",
        "desc": "Defeat the spiders crawling on the ship near the entrance to get two blue coins. <br><br>\n        One spider is near the bow of the ship and climbing on a vertical grate, slam the grate from the other side to defeat it. (this is the one you get this coin from)<br><br>\n        The other spider is crawling under a grate in the middle of the ship. Ground pound the crate above to defeat it. <br><br>\n        In some episodes a third spider appears but it doesn't drop anything. <br><br>\n\t\tAppears starting <b>episode 3</b>.",
        "video": "https://youtu.be/UySt5a6c3Sw"
      },
      {
        "title": "Ship spiders (B)",
        "desc": "Defeat the spiders crawling on the ship near the entrance to get two blue coins. <br><br>\n        One spider is near the bow of the ship and climbing on a vertical grate, slam the grate from the other side to defeat it.<br><br>\n        The other spider is crawling under a grate in the middle of the ship. Ground pound the crate above to defeat it. (this is the one you get this coin from) <br><br>\n        In some episodes a third spider appears but it doesn't drop anything. <br><br>\n\t\tAppears starting <b>episode 3</b>.",
        "video": "https://youtu.be/PBTJyYfUFK4"
      },
      {
        "title": "Wall spider",
        "desc": "Spray the spider that's crawling on the wall near the cement area, then jump and press B button to hit it. Alternatively, you can use Yoshi to eat it. <br><br>\n\t\tAppears starting <b>episode 3</b>.",
        "video": "https://youtu.be/PvuSLq5fQLA"
      },
      {
        "title": "Butterfly",
        "desc": "Get Yoshi and hunt for butterflies in the market area. Have Yoshi eat the group of blue butterflies to get a blue coin. <br><br>\n        You need to unlock Yoshi before the Yoshi egg will begin appearing in the level. In this level Yoshi always needs a durian to wake up, so you need to keep pounding the fruit towers until you get one. <br><br>\n        Yoshi only appears in <b>episode 8</b> in this level.",
        "video": "https://youtu.be/RU4zPvkFFkQ"
      }
    ],
    "title": "Ricco Harbor",
    "link": "https://strategywiki.org/wiki/Super_Mario_Sunshine/Ricco_Harbor_blue_coins"
  },
  "sb": {
    "coins": [
      {
        "title": "Ocean floor",
        "desc": "Go to the left end of the beach and keep following the cliff to the left until the water starts to get deep. <br><br>\n        Dive and look around for the coin that's on the ocean floor. <br><br>\n\t\t<b>Appears in all episodes.</b>",
        "video": "https://youtu.be/tILoKkcdHxc"
      },
      {
        "title": "Cabana ceiling",
        "desc": "Head toward the hotel and look under the roof of the cabana on the right to find a blue coin and a gold coin. Hop on the bar and hop again to get the coins. <br><br>\n\t\tAvailable starting <b>episode 2</b>.",
        "video": "https://youtu.be/mwA0wCdNuro"
      },
      {
        "title": "Hotel ledge",
        "desc": "Go around to the back of the hotel. There will be a blue coin sitting on a ledge one floor up. <br><br>\n        To reach it, back-flip into the wall behind the hotel and wall jump toward the hotel, then <i>hover</i> to the ledge. <br><br>\n\t\tAvailable starting <b>episode 2</b>.",
        "video": "https://youtu.be/UeMw6CmMnCI"
      },
      {
        "title": "Room A",
        "desc": "Find a blue coin in a row with two gold coins in the bedroom. <br><br>\n\t\tAvailable <b>all episodes except 1, 2 and 6</b>.",
        "video": "https://youtu.be/s4M4Pou7eJQ"
      },
      {
        "title": "Room B",
        "desc": "Find a blue coin in a square with three gold coins. <br><br>\n\t\tAvailable <b>all episodes except 1, 2 and 6</b>.",
        "video": "https://youtu.be/KYACYjg58VY"
      },
      {
        "title": "Room H",
        "desc": "Find a blue coin in a rectangle with five gold coins. <br><br>\n\t\tAvailable <b>all episodes except 1, 2 and 6</b>.",
        "video": "https://youtu.be/kXfygXVwnj8"
      },
      {
        "title": "Attic cul-de-sac",
        "desc": "Get up to the attic by bouncing on the bed in room K. Go clockwise to the next corner and get to the second passage in from the outer edge. <br><br>\n        Find a coin in the cul-de-sac where the passage ends. <br><br>\n\t\tAvailable <b>all episodes except 1, 2 and 6</b>.",
        "video": "https://youtu.be/ZefriEmQ7yM"
      },
      {
        "title": "Cabana M",
        "desc": "Go toward the hotel to the cabana on the right. Check the wall behind and to the right of this to find a graffiti M. Wash it off go get a coin. <br><br>\n\t\tAvailable starting <b>episode 7</b>.",
        "video": "https://youtu.be/OQdmFJBmlGQ"
      },
      {
        "title": "Stairwell M",
        "desc": "Go to the top floor and check the wall between the pool and the stairwell for a graffiti M. Wash it off go get a coin. <br><br>\n\t\tAvailable starting <b>episode 7</b>.",
        "video": "https://youtu.be/lZL5ickaByA"
      },
      {
        "title": "Attic M",
        "desc": "Get up to the attic by bouncing on the bed in room K. Get around to the other side of the skylight and find the small room next to it. <br><br>\n        Check the wall behind four gold coins for a graffiti M. Wash it off go get a blue coin. <br><br>\n\t\tAvailable starting <b>episode 7</b>.",
        "video": "https://youtu.be/uxDHdYY96uY"
      },
      {
        "title": "Paired crosses (A)",
        "desc": "Locate the graffiti cross on the hallway wall left of room F. Then locate a corresponding cross on the hallway wall between rooms G and H. <br><br>\n        Wash one cross off to make a blue coin appear at the other cross, then quickly get to the other cross to collect the coin before it disappears. <br><br>\n        The crosses are on different floors but they are both close enough to the stairwell that you can rush up or down it to get to the other location in time. To save time and avoid confusion caused by changing camera angle, stand next to the stairs when you do the washing. <br><br>\n\t\tAvailable starting <b>episode 7</b>.",
        "video": "https://youtu.be/3tHS0XJbFr0"
      },
      {
        "title": "Paired crosses (B)",
        "desc": "Locate the graffiti cross on the hallway wall between rooms G and H. Then locate a corresponding cross on the hallway wall left of room F. <br><br>\n        Wash one cross off to make a blue coin appear at the other cross, then quickly get to the other cross to collect the coin before it disappears. <br><br>\n        The crosses are on different floors but they are both close enough to the stairwell that you can rush up or down it to get to the other location in time. To save time and avoid confusion caused by changing camera angle, stand next to the stairs when you do the washing. <br><br>\n\t\tAvailable starting <b>episode 7</b>.",
        "video": "https://youtu.be/d8kNtlrMHCs"
      },
      {
        "title": "Paired triangles (A)",
        "desc": "Locate the graffiti triangle on the wall on the lobby opposite the front desk. It's in a lounge area with a fruit stand at one end. Then locate the corresponding triangle on the hallway wall between rooms C and D. <br><br>\n        Wash the graffiti and rush to get the coins. This time the symbols are far enough away from the stairwell that it's probably impossible to get from one location to the other using it. <br><br>\n        To get from the upper location to the lower one just drop over the balcony, being careful not to land on one of the burning torches below. To get from the lower location to the upper one, stand next to the totem pole when you wash the triangle, this takes longer but it doesn't matter. <br><br>\n        Then when the coin pops out quickly switch to <i>hover</i>, do a back-flip into the totem pole, wall kick up, and <i>hover</i> to the balcony. This is tricky and may take a few tries. <br><br>\n\t\tAvailable starting <b>episode 7</b>.",
        "video": "https://youtu.be/Y2C6GWYGWFw"
      },
      {
        "title": "Paired triangles (B)",
        "desc": "Locate the graffiti triangle on the hallway wall between rooms C and D. Then locate the corresponding triangle on the wall on the lobby opposite the front desk. It's in a lounge area with a fruit stand at one end. <br><br>\n        Wash the graffiti and rush to get the coins. This time the symbols are far enough away from the stairwell that it's probably impossible to get from one location to the other using it. <br><br>\n        To get from the upper location to the lower one just drop over the balcony, being careful not to land on one of the burning torches below. To get from the lower location to the upper one, stand next to the totem pole when you wash the triangle, this takes longer but it doesn't matter. <br><br>\n        Then when the coin pops out quickly switch to <i>hover</i>, do a back-flip into the totem pole, wall kick up, and <i>hover</i> to the balcony. This is tricky and may take a few tries. <br><br>\n\t\tAvailable starting <b>episode 7</b>.",
        "video": "https://youtu.be/1h5grt-QX3Y"
      },
      {
        "title": "Casino M",
        "desc": "Enter the casino and immediately turn around and look up to spot a graffiti M over the entrance. Wash it off go get a coin. <br><br>\n        You might think this would be visible in episode 4 since you go through the casino then, but no. <br><br>\n\t\tAvailable <b>episode 5 only</b>.",
        "video": "https://youtu.be/XpIOe-JG618"
      },
      {
        "title": "Unlucky Noki (A)",
        "desc": "In <b>episode 1</b>, starting from the beach, hop up the ledge to the right to a tree with a fountain moat around it. <br><br>\n        Wash the goop off the ground between the moat and the cabana to rescue a Noki couple. In <b>episode 6</b> the same couple needs rescuing again, wash the ground behind the lawn chairs to the left of the same tree. <br><br>\n        Wash them clean and talk to them to get a blue coin from each as a reward. Can be repeated for 1-ups. <br><br>\n\t\tAvailable <b>episodes 1 and 6 only</b>.",
        "video": "https://youtu.be/0csNSQSGn0I"
      },
      {
        "title": "Unlucky Noki (B)",
        "desc": "In <b>episode 1</b>, starting from the beach, hop up the ledge to the right to a tree with a fountain moat around it. <br><br>\n        Wash the goop off the ground between the moat and the cabana to rescue a Noki couple. In <b>episode 6</b> the same couple needs rescuing again, wash the ground behind the lawn chairs to the left of the same tree. <br><br>\n        Wash them clean and talk to them to get a blue coin from each as a reward. Can be repeated for 1-ups. <br><br>\n\t\tAvailable <b>episodes 1 and 6 only</b>.",
        "video": "https://youtu.be/0csNSQSGn0I"
      },
      {
        "title": "Slightly Lucky Noki (A)",
        "desc": "Starting from the beach, hop up the ledge to the left to a tree with a fountain moat around it. <br><br>\n        Wash the goop off the ground between the moat and the cabana to rescue a Noki couple. This couple escaped the goop from <b>episode 1</b>, making them slightly luckier than the unlucky Noki couple. <br><br>\n        Wash them clean and talk to them to get a blue coin from each as a reward. Can be repeated for 1-ups. <br><br>\n\t\tAvailable <b>episodes 6 only</b>.",
        "video": "https://youtu.be/EpdiVUS99qc"
      },
      {
        "title": "Slightly Lucky Noki (B)",
        "desc": "Starting from the beach, hop up the ledge to the left to a tree with a fountain moat around it. <br><br>\n        Wash the goop off the ground between the moat and the cabana to rescue a Noki couple. This couple escaped the goop from <b>episode 1</b>, making them slightly luckier than the unlucky Noki couple. <br><br>\n        Wash them clean and talk to them to get a blue coin from each as a reward. Can be repeated for 1-ups. <br><br>\n\t\tAvailable <b>episodes 6 only</b>.",
        "video": "https://youtu.be/xHg2Vq0ekIk"
      },
      {
        "title": "Hotel sign",
        "desc": "Starting from the beach, hop up the ledge and spray a small, square sign in front of the lawn chairs to make a coin pop out. <br><br>\n\t\tAvailable starting <b>episode 2</b>.",
        "video": "https://youtu.be/7d4kCwubz-0"
      },
      {
        "title": "Douse the flame",
        "desc": "Notice the eight flames burning in braziers in front of the hotel. <br><br>\n        Spray the second one from the left to get a blue coin. You get a gold coin if you spray one of the other seven or one of the two flames on the ledge above. <br><br>\n\t\tAvailable starting <b>episode 2</b>.",
        "video": "https://youtu.be/Uh1r8xvZhaU"
      },
      {
        "title": "Water the flowers",
        "desc": "Go to the corner on the right behind the hotel. There is a round bed of flowers in front of a small fountain. Spray the flowers and a coin will pop out. <br><br>\n\t\tAvailable starting <b>episode 2</b>.",
        "video": "https://youtu.be/u7qjcxO6LF8"
      },
      {
        "title": "Room G",
        "desc": "Spray the mirror over the bed to make a blue shine logo appear. When the logo is fully formed a blue coin pops out. <br><br>\n\t\tAvailable <b>all episodes except 1, 2 and 6</b>.",
        "video": "https://youtu.be/mEBJ6dD3-wc"
      },
      {
        "title": "Room I",
        "desc": "Spray the empty shelves on the right in the room with the Boo poster to make a coin pop out. <br><br>\n\t\tAvailable <b>all episodes except 1, 2 and 6</b>.",
        "video": "https://youtu.be/Zt2DurjfIng"
      },
      {
        "title": "Pool lamp",
        "desc": "Spray the lamp in the corner to the left of the pool. A coin will pop out. <br><br>\n\t\tAvailable <b>all episodes except 1 and 6</b>.",
        "video": "https://youtu.be/YXBSYaCzo4I"
      },
      {
        "title": "Skylight",
        "desc": "Wash the skylight on the upper floor and a coin pops out to land on top of the totem pole. <br><br>\n\t\tAvailable <b>all episodes except 1, 2 and 6</b>.",
        "video": "https://youtu.be/mGITSYph4Co"
      },
      {
        "title": "Fountain flame",
        "desc": "On the far wall there are two small pools, each with a flame coming out of a jar. Spray the one on the right for a coin. <br><br>\n\t\tAvailable <b>episodes 4 and 5 only</b>.",
        "video": "https://youtu.be/TA1HGr0-Lh8"
      },
      {
        "title": "Hotel: Room C",
        "desc": "Break the box closest to the doorway leading to room B to get a coin. <br><br>\n\t\tAvailable <b>all episodes except 1, 2, 3 and 6</b>.",
        "video": "https://youtu.be/UJxA6Y_Dc_Q"
      },
      {
        "title": "Casino: play slots",
        "desc": "There are two sets of normal size slot machines in the casino. To play, hop onto a stool and do a ground pound. <br><br>\n        Sometimes you win gold coins and one machine, left set second from the right, gives you a blue coin. In <b>episode 4</b> there are other slot players, but in <b>episode 5</b> you have the all the machines to yourself. <br><br>\n\t\tAvailable <b>episodes 4 and 5 only</b>.",
        "video": "https://youtu.be/yvQ6gaSW8pM"
      },
      {
        "title": "Boo in the attic",
        "desc": "Get up to the attic by bouncing on the bed in room K, then defeat the lone boo that's wandering around there to get a blue coin. <br><br>\n\t\tAvailable <b>all episodes except 1, 2, 3 and 6</b>.",
        "video": "https://youtu.be/xBYwviWnAyo"
      }
    ],
    "title": "Sirena Beach",
    "link": "https://strategywiki.org/wiki/Super_Mario_Sunshine/Sirena_Beach_blue_coins"
  },
  "bh": {
    "coins": [
      {
        "title": "Stream",
        "desc": "Go down the path from the start and follow the stream left when you reach it. There is a blue coin in the water by the gate at the end. <br><br>\n        <b>Appears in all episodes.</b>",
        "video": "https://youtu.be/QzqotyS_T84"
      },
      {
        "title": "North lake",
        "desc": "As you cross the bridge leading to big windmill, look to the right and you may spot this coin under the water. <br><br>\n        This coin actually shifts position from episode to episode if you don't collect it, in <b>episode 1</b> it's next to the series of platforms that cross under the bridge and by <b>episode 6</b> it's close to cave entrance behind the big windmill. Then it moves back for <b>episodes 7 and 8</b>.<br>\n        <p><b>Appears in all episodes</b> though in <b>episode 6</b> you must brave poisonous water to reach it.",
        "video": "https://youtu.be/pgYg7bMu2JA"
      },
      {
        "title": "South lake",
        "desc": "Cross the bridge leading to the big windmill and look into the water on the left. <br><br>\n        This coin appears in <b>episode 6</b> with a trail of gold coins leading up to it, but you have to swim in poisonous water to reach it. <br><br>\n        Appears without the gold coins in <b>episodes 7 and 8</b>, making it harder to find but easier to reach.",
        "video": "https://youtu.be/9WtlIEHJ_n4"
      },
      {
        "title": "Windmill ledge",
        "desc": "Find the windmill near the end of the stream, then look for a coin floating in the air next to it.<br><br>\n        To reach it, get to the roof of one of the buildings, then <i>hover</i> to a ledge attached to the windmill next to it. You can then spray the windmill to move the ledge into a better position, or <i>hover</i> to the a closer ledge.<br><br>\n        When you reach the windmill with the coin next to it you can <i>hover</i> to the coin or move the ledge to it. <br>\n        Collecting the coin is easy though once you get the <i>rocket nozzle</i>, simply stand on the coin's shadow and fire the rocket. <br><br>\n        <b>Appears in all episodes.</b>",
        "video": "https://youtu.be/sSFlxog_75Y"
      },
      {
        "title": "The two towers",
        "desc": "Find the building on the far side of the village with two towers (and no windmills) on top. Look in the belfry on the right tower to find a coin.<br><br>\n        This can be reached easily with the <i>rocket nozzle</i>, or you can <i>hover</i> between ledges as in the windmill ledge coin, or you can use the building's unique shape with a triple jump, spin jump, back-flip and/or wall-jump. <br><br><b>Appears in all episodes.</b>",
        "video": "https://youtu.be/8MmzikwVZpc"
      },
      {
        "title": "West cliff",
        "desc": "To the right of the gated end of the stream is high ledge set into a cliff and a coin sits on the ledge. <br><br>\n        This can be reached easily with the <i>rocket nozzle</i>, but it's also possible to get there by <i>hover</i>ing from the house with two towers. <br><br>\n        Appears starting <b>episode 3</b>.",
        "video": "https://youtu.be/LbPbhI1T6uE"
      },
      {
        "title": "Cliff platform",
        "desc": "On top of the cliff behind the town are five platforms with a blue coin on top.<br><br>\n        Can be reached easily with the <i>rocket nozzle</i>, or without it by following wires from the house with two towers and <i>hover</i>ing from the highest mini-windmill near the cliff. <br><br>\n        Appears starting <b>episode 5</b>.",
        "video": "https://youtu.be/uWhf78554Ok"
      },
      {
        "title": "Under bridge",
        "desc": "There's a blue coin under the bridge leading to the big windmill. You can get to it by trampoline-jumping from the rope under it. <br><br>\n        Appears starting <b>episode 4</b>.",
        "video": "https://youtu.be/DBAbh6qKhaA"
      },
      {
        "title": "Village mini-windmill",
        "desc": "Locate the mini-windmill between the house with two towers and cliff behind it. Next to it, not quite at the top, is a floating blue coin.<br><br>\n        Use the <i>rocket nozzle</i> or jump on wires to reach. <br><br>\n        Appears starting <b>episode 6</b>.",
        "video": "https://youtu.be/0OF3nu33-U0"
      },
      {
        "title": "Lake mini-windmill",
        "desc": "There is a blue coin above the mini-windmill to the left of the big windmill when facing it from the front. The mini windmill has two flags hanging from the side of it. <br><br>\n        To reach it, ride one of the big windmill vanes half-way up, then jump and <i>hover</i>. More wires and the <i>rocket nozzle</i> appear in later episodes giving alternatives. <br><br>\n        Appears starting <b>episode 3</b>.",
        "video": "https://youtu.be/4p2JZfAWkyQ"
      },
      {
        "title": "Wall M",
        "desc": "There is a graffiti M painted on the wall by the water wheel on the village side. Wash the wall clean to make a blue coin pop out. <br><br>\n        <b>Appears in all episodes.</b>",
        "video": "https://youtu.be/AFMu46RD4Vg"
      },
      {
        "title": "Wall top M",
        "desc": "Check the top of the wall, also near the water wheel. <i>hover</i> over it to wash it clean. <br><br>\n        <b>Appears in all episodes.</b>",
        "video": "https://youtu.be/mhQJyJYxCx4"
      },
      {
        "title": "House M",
        "desc": "There is graffiti M painted on the back wall of the building with two towers. Wash the wall clean to make a blue coin pop out. <br><br>\n        <b>Appears in all episodes.</b>",
        "video": "https://youtu.be/W25dt01SkRo"
      },
      {
        "title": "Paired crosses (A)",
        "desc": "Locate a graffiti cross on the tree side of the wall. Locate a corresponding cross inside the well formed between two branches of the wall.<br><br>\n        Wash one cross off to make a blue coin appear at the other cross, then quickly get to the other cross to collect the coin before it disappears.<br>\n        It helps to be standing on the wall when washing so you can quickly get to the other location. Do both crosses to collect two coins. <br><br><b>Appears in all episodes.</b>",
        "video": "https://youtu.be/5R1zRKExPjg"
      },
      {
        "title": "Paired crosses (B)",
        "desc": "Locate a graffiti cross on the tree side of the wall. Locate a corresponding cross inside the well formed between two branches of the wall.<br><br>\n        Wash one cross off to make a blue coin appear at the other cross, then quickly get to the other cross to collect the coin before it disappears.<br>\n        It helps to be standing on the wall when washing so you can quickly get to the other location. Do both crosses to collect two coins. <br><br><b>Appears in all episodes.</b>",
        "video": "https://youtu.be/Ohzj66k8EQ4"
      },
      {
        "title": "Windmill M",
        "desc": "Go all the way up the ramp to the base of the big windmill to find a graffiti M. Wash it off for a coin. <br><br>\n        <b>Appears in all episodes.</b>",
        "video": "https://youtu.be/3aanxdV1Rro"
      },
      {
        "title": "Paired circles (A)",
        "desc": "Locate a graffiti circle on the back of the building with two towers. Locate a corresponding circle on the back of the building with the tall mini-windmill on top. <br><br>\n        Wash one circle off to make a blue coin appear at the other circle, then quickly get to the other circle to collect the coin before it disappears. <br>\n        The slip-slide move is very useful here for covering the distance in time, or get the <i>turbo nozzle</i> and use it. Do both circles to collect two coins. <br><br>\n        Appears starting <b>episode 7</b>.",
        "video": "https://youtu.be/T3SRQZcryQQ"
      },
      {
        "title": "Paired circles (B)",
        "desc": "Locate a graffiti circle on the back of the building with two towers. Locate a corresponding circle on the back of the building with the tall mini-windmill on top. <br><br>\n        Wash one circle off to make a blue coin appear at the other circle, then quickly get to the other circle to collect the coin before it disappears. <br>\n        The slip-slide move is very useful here for covering the distance in time, or get the <i>turbo nozzle</i> and use it. Do both circles to collect two coins. <br><br>\n        Appears starting <b>episode 7</b>.",
        "video": "https://youtu.be/EAI8MlJ1bsU"
      },
      {
        "title": "Balcony",
        "desc": "Go down the path from the start and <i>hover</i> over the river to find two buildings connected by a pair of wires.<br><br>\n        Wall jump to the lower wire, the bounce up to the second and hop over the roof of the left building. This building has two section connected by an arch. The taller section has a balcony on one side.<br>\n        Hop and <i>hover</i> into the balcony and notice two door-like openings there. Spray one of these doorways for a gold coin and the other for a blue coin.<br><br>\n        Note, the side the blue coin is on changes depending on the episode, left in <b>episodes 1, 3, 4, and 5</b> and right in <b>episodes 2, 6, 7 and 8.</b>",
        "video": "https://youtu.be/mKfsjz98XFc"
      },
      {
        "title": "Tree top",
        "desc": "Get to the top of the wall and hop over to the tree tops. <br><br>\n        Go to the one closest to the water wheel, then <i>hover</i> over it or wash the top so the crown is well drenched. A coin will pop out.<br><br>\n        Appears starting <b>episode 3</b>.",
        "video": "https://youtu.be/pKqkM1H-IDA"
      },
      {
        "title": "River mini-windmill",
        "desc": "Locate the mini-windmill standing in the river on the tree side of the wall. <br><br>\n        You need to spin the windmill blades, so stand on the wall in front of the blades until they turn fast and a coin will pop out. <br><br>\n        Another way, which is useful for getting gold coins from the remaining mini-windmills, is to stand on the windmill platform and walk toward the blades until you hang off the edge. Then use the <i>hover nozzle </i> to spray the blades from above. <br><br>\n        <b>Appears in all episodes.</b>",
        "video": "https://youtu.be/kzkvwrcBcS0"
      },
      {
        "title": "Lake spire",
        "desc": "Follow the ledge around the base of the big windmill and find the spire sticking up out of the lake behind it. <br><br>\n        Spray the top of it with water and a blue coin will pop out. <i>hover</i> over to reach it.",
        "video": "https://youtu.be/a7V2fO7Or70"
      },
      {
        "title": "Gorge spire",
        "desc": "Go to the top of the cliff behind the village and find a spire sticking out of the gorge. (This is where Petey Piranha was sleeping in <b>episode 5</b>.)<br><br>\n        There are two clouds floating around between the fence and this spire. Spray the nearest cloud so it grows, then <i>hover</i> over to it, making sure that after you land you get to the center before the cloud shrinks again.<br><br>\n        Spray the top of the spire to make a blue coin appear, then use the second cloud to reach the coin. Use the same cloud hopping technique to get back to safety. <br><br>\n        Appears starting <b>episode 6</b>.",
        "video": "https://youtu.be/VuEYfbPxUJg"
      },
      {
        "title": "Blue parrot",
        "desc": "Locate the building with the tall mini-windmill on top.<br><br>\n        There is a blue parrot which, if left alone, will perch either on this windmill on the wire that connects it to the house with two towers. <br><br>\n\n        Follow the wire or use the rocket to get to the top of the windmill, then wait for the parrot to fly near and squirt it in mid-air. A few good hits should turn it into a blue coin. <br><br>\n        Appears starting <b>episode 6</b>.",
        "video": "https://youtu.be/RGJVORj6UVs"
      },
      {
        "title": "Pianta in brown",
        "desc": "Locate a Pianta in a brown shirt and wash the goop off him. Talk to him to get a blue coin as a reward. <br><br>\n        The location of this Pianta varies from episode to episode but he first appears in episode 3. <br><br>\n        <u>The locations are:</u>\n        <ul>\n          <li><b>Episode 3</b> - on the road to the big windmill</li>\n          <li><b>Episode 4</b> - on the ledge below and to the left of Hillside Cave.</li>\n          <li><b>Episode 5</b> - on the river bank across from the trees.</li>\n          <li><b>Episode 6</b> - on top of the cliff behind the village.</li>\n          <li><b>Episode 7</b> - on top of the big windmill</li>\n          <li><b>Episode 8</b> - inside the well formed by two branches of the wall.</li>\n        </ul>",
        "video": "https://youtu.be/2Pq8GsRXEgk"
      },
      {
        "title": "Pianta in black",
        "desc": "Locate a Pianta in a black shirt standing on a circular platform at the corner of the wall.<br><br>\n        Wash the goop off of him and talk to him to get a blue coin as a reward. <br><br>Appears starting <b>episode 5</b>.",
        "video": "https://youtu.be/nGN2-rjybt8"
      },
      {
        "title": "Windmill pokey",
        "desc": "Get to the top of the big windmill as in <b>episode 2</b> and defeat the pokey there. A blue coin appears in its place. <br><br>\n        Appears starting <b>episode 3</b>.",
        "video": "https://youtu.be/Pj7fu7QefTo"
      },
      {
        "title": "Ledge pokey",
        "desc": "Locate the three reddish ledges sticking out over where the lake feeds into the river. Defeat the pokey on the left ledge to win a blue coin. <br><br>\n        Appears starting <b>episode 4</b>.",
        "video": "https://youtu.be/YI1K2SLz3Y0"
      },
      {
        "title": "Butterfly",
        "desc": "Get Yoshi and hunt for butterflies in the village area. Have Yoshi eat the blue butterfly to get a blue coin.<br><br>\n        <u>Warning:</u> <br>\n        You can reach this episode in the game before unlocking Yoshi, the Yoshi will not appear and you won't be able to collect these coins. With Yoshi unlocked, the egg appears in <b>episode 8</b>.<br><br>\n        To wake up Yoshi, notice the fruit that appears in Yoshi's thought bubble as you pass his egg at the start. Then head for the tree area to collect the fruit and bring it back to Yoshi. <br><br>\n        Banana, pineapple, papaya and durian can be found under the trees, and banana and coconut can be found on the bank opposite the river.<br><br>\n    ",
        "video": "https://youtu.be/OScLnITpffk"
      },
      {
        "title": "Beehive",
        "desc": "There are two beehives but only one has a blue coin.<br>\n        Spray the beehive closer to the lake until it falls down, then have Yoshi eat the bees. Each bee turns into a gold coin except the last one which turns into a blue coin.<br><br>\n        <u>Warning:</u> <br>\n        You can reach this episode in the game before unlocking Yoshi, the Yoshi will not appear and you won't be able to collect these coins. With Yoshi unlocked, the egg appears in <b>episode 8</b>.<br><br>\n        To wake up Yoshi, notice the fruit that appears in Yoshi's thought bubble as you pass his egg at the start. Then head for the tree area to collect the fruit and bring it back to Yoshi. <br><br>\n        Banana, pineapple, papaya and durian can be found under the trees, and banana and coconut can be found on the bank opposite the river.\n    ",
        "video": "https://youtu.be/VQM4sfTE1vY"
      }
    ],
    "title": "Bianco Hills",
    "link": "https://strategywiki.org/wiki/Super_Mario_Sunshine/Bianco_Hills_blue_coins"
  }
}
